[
	{
		"id": "1",
		"title": "Mariners hand Tigers 18th shutout loss, complete sweep",
		"date": "09/01/2022 01:15 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "Sam Haggerty dives into the foul ball netting to make a catch that is overturned after review. (0:42)\n\nDETROIT -- — Julio Rodriguez and Ty France hit back-to-back home runs in the third inning and the Seattle Mariners completed a three-game series sweep by defeating the Detroit Tigers 7-0 on Thursday.\n\nFrance and Curt Casali drove in two runs apiece as the Mariners won for the sixth time in seven games. The Tigers were shut out for the 18th time this season.\n\n“We're getting better at the right time,” Seattle manager Scott Servais said. “I don't think we've reached our ceiling yet and it's a really high one.”\n\nLogan Gilbert (11-5), who had gone winless in his previous nine starts, held Detroit to two hits and a walk while striking out nine in six innings. Gilbert's last victory came on July 5.\n\n“Logan has had a tremendous season,” Servais said. “He had a couple of starts against the Yankees that didn't go so well. If you take those couple starts out, his numbers are awesome. He's had a really good year for us, but it was nice to get him a win today.”\n\nGilbert established his fastball early, then frustrated the Tigers with his slider. His strikeout total tied a season high. He only notched a combined 15 strikeouts in his previous five starts.\n\n“August wasn't my best. I feel pretty good,” Gilbert said. “I didn't feel like I was that far off. Hopefully, this is a good sign to keep rolling from here.”\n\nTigers starter Eduardo Rodriguez (3-4) surrendered six runs, five earned, and six hits in four innings.\n\nDetroit rookie Riley Greene had two singles, extending his hitting streak to 10 games.\n\nSeattle scored an unearned run in the first on Eugenio Suarez's RBI single. Rodriguez blasted his 22nd homer on Eduardo Rodriguez's first pitch of the third inning. France followed with his 17th homer.\n\nThe Mariners increased their lead to 6-0 in the fourth on Casali's two-run double and France's run-scoring single.\n\nOutside of Greene, the Tigers only had two hits, none for extra bases. They also struck out 11 times.\n\n“They clearly outplayed us,” Detroit manager A.J. Hinch said. “Offensively, we had a really tough time handling Gilbert's fastball. The discouraging part is when there's little to no offense.”\n\nROSTER MOVES\n\nMariners: LHP Matt Boyd was reinstated from the 60-day Injured List and OF Taylor Trammell was recalled from Triple-A Tacoma as major league rosters expanded to 28 players. Boyd, who made 143 starts for Detroit from 2015-21, was acquired from San Francisco. Trammell has appeared in 32 games with the Mariners this season, batting .235 with three home runs.\n\nBoyd, who underwent flexor tendon surgery last year, recorded three groundouts during the eighth inning in his Seattle and season debut. Trammell batted ninth and went 0-for-3 with a walk.\n\nTigers: 1B Spencer Torkelson and INF Ryan Kreidler were called up from Triple A Toledo and RHP Michael Pineda (right triceps strain) was reinstated from the 15-day injured list. Pineda will start against Kansas City on Saturday. INF Zack Short was optioned to Toledo and RHP Rony Garcia (right shoulder soreness) was transferred to the 60-day IL.\n\nUP NEXT\n\nMariners: RHP Luis Castillo (5-5, 2.85 ERA) will start the opener of a three-game series in Cleveland on Friday. Castillo held the Guardians to one run while striking out 10 in six innings on Saturday but wound up with a no-decision.\n\nTigers: RHP Drew Hutchison (2-7, 4.01 ERA) will start the opener of a three-game home series against Kansas City on Friday. Hutchison has only allowed 10 earned runs in his last six starts.\n\n------\n\nAs they try to hang on to their slim lead in the AL Central, the Guardians lost Zach Plesac (broken hand) and Aaron Civale (forearm inflammation) to the 15-day injured list.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n"
	},
	{
		"id": "2",
		"title": "Toro's two-run HR carries Mariners past Tigers, 5-3",
		"date": "08/31/2022 07:22 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "Abraham Toro puts the Mariners ahead in the seventh with a two-run homer. (0:37)\n\nDETROIT -- — Abraham Toro hit a go-ahead, two-run homer in the seventh inning and the Seattle Mariners beat the Detroit Tigers 5-3 on Wednesday night for their fifth win in six games.\n\nToro, recalled from Triple-A Tacoma on Tuesday, had two hits and Eugenio Suarez also hit a two-run homer for the Mariners.\n\n“I just like those moments,” Toro said. “Tight situations and you just want to drive that run in. ... You want to get the ball in the air and I was able to do that.”\n\nSeattle manager Scott Servais feels Toro's .187 batting average is deceiving.\n\n“He goes up there in an aggressive mode,” Servais said. “He's gotten a lot of big hits. People look at his batting average and inconsistencies but the home runs he's hit late in games and the big hits he's had late in games have won us quite a few games.”\n\nSeattle starter Marco Gonzales (10-12) allowed three runs and seven hits in six innings. Paul Sewald worked around two walks in the ninth to get his 17th save.\n\nGonzales didn't give up a run in his last four innings after making a uniform change.\n\n“I came in and changed my jersey,” he said. “I just needed to change it up. I didn't feel like myself. I felt kind of shaky, a little off. I came in and changed my jersey and we rolled from there.”\n\nJeimer Candelario drove in two runs for Detroit. Starting pitcher Tyler Alexander allowed two runs in 4 2/3 innings, while Alex Lange (4-4) took the loss.\n\nSuarez's 25th homer of the season came on a 3-0 pitch from Alexander in the first inning.\n\nDetroit evened the score with two second-inning runs on Candelario's RBI single and Willi Castro's fielder's choice grounder. Candelario's second run-scoring single of the game gave Detroit a 3-2 edge in the sixth.\n\nThe Tigers had some bad luck, as three innings ended with line drives with runners on base.\n\n“A foot either way and you're talking about breaking the game open,” manager A.J. Hinch said. “In a close game, it feels like you have to be perfect. They've been very good in close games and I think we saw why tonight.”\n\nSeattle regained the advantage when Toro followed Adam Frazier's triple with a one-out blast off Lange in the seventh. Ty France drew a bases-loaded walk in the ninth to give the Mariners a two-run lead.\n\nGRAND MILESTONE\n\nScott Servais managed his 1,000th game for the Mariners on Wednesday. Servais has managed the second-most games in Mariners history, trailing only Lou Piniella (1,551 games).\n\nROSTER MOVES\n\nMariners: LHP Matthew Boyd and OF Taylor Trammell will be activated when the rosters expand to 28 players on Thursday. Boyd made 143 starts for Detroit from 2015-21 and signed with San Francisco as a free agent during the offseason while recovering from left flexor tendon surgery. Boyd, who was traded to Seattle in early August but has yet to make his season debut, will be used out of the bullpen. Trammell has appeared in 32 games with the Mariners this season, batting .235 with three homers.\n\nTigers: 1B Spencer Torkelson and INF Ryan Kreidler will be activated when rosters expand on Thursday. Torkelson batted just .197 in 83 games with Detroit before getting demoted to Triple-A Toledo, where he hit .228 with five homers in 34 games. Kreidler batted .213 with eight homers in 56 games with the Mud Hens. ... RHP Michael Pineda (right tricep tightness) will also be activated from the 15-day injured list. Pineda's last major-league appearance was July 23.\n\nTRAINER'S ROOM\n\nMariners; SS J.P. Crawford (strained pectoral muscle) didn't start the game but entered as a defensive replacement in the eighth.\n\nUP NEXT\n\nMariners: RHP Logan Gilbert (10-5, 3.49 ERA) will look to end a nine-game winless drought in the series finale on Thursday afternoon. Gilbert's last victory came on July 5.\n\nTigers: LHP Eduardo Rodriguez (3-3, 3.60 ERA) has won both of his starts since coming off the restricted list. Rodriguez has a 4-3 record and 3.46 ERA in nine career outings against Seattle.\n\nAs they try to hang on to their slim lead in the AL Central, the Guardians lost Zach Plesac (broken hand) and Aaron Civale (forearm inflammation) to the 15-day injured list.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n"
	},
	{
		"id": "3",
		"title": "Ray's Day: Robbie Ray dominant as Mariners top Guardians 4-0",
		"date": "08/28/2022 04:13 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — While Robbie Ray was again dominant against a potential playoff foe, there was a more important development for the Seattle Mariners on Sunday.\n\nPerhaps All-Star Ty France is on the verge of breaking out of his extended slump and rediscovering the swing that made him one of best hitters in the American League during the first half of the season.\n\n“We need Ty France's bat back and it showed up today,” Seattle manager Scott Servais said. “I’m really excited about that.”\n\nRay tossed seven dominant innings, Dylan Moore and France homered and the Mariners beat the Cleveland Guardians 4-0 on Sunday.\n\nSeattle took three of four from Cleveland in a potential postseason preview. All four games were tight and well-pitched, and the Mariners squeezed out just enough offense to earn a series victory.\n\nThe teams will run it back with a three-game set in Cleveland next weekend and perhaps again in October.\n\n“We knew their games were going to be tight. We needed to play good defense and pitch well and we exceeded my expectations pitching-wise,” Servais said. “That’s about as good as you can pitch.”\n\nThe Guardians' lead in the AL Central was trimmed to two games over Minnesota, which completed a sweep at home against San Francisco. Cleveland manager Terry Francona was complimentary of Ray's performance and Seattle's entire staff.\n\n“Their entire staff is impressive. I mean, you've got your work cut out for you,\" Francona said. \"That doesn't mean you can't win, but you got your work cut out for you.”\n\nRay, last year’s AL Cy Young Award winner with Toronto, continued his August surge by winning his third straight start.\n\nBut Seattle's offense has been meager of late in part due to France's slump. He started the day hitting just .122 in August and was in an 0-for-21 slump when he singled in the fifth off Cleveland starter Aaron Civale.\n\nFrance came back two innings later and hit the second pitch of the seventh inning out to left field for his 15th homer of the season.\n\n“After the first hit, definitely felt like a weight was lifted off,” France said. “This whole series I felt like I was seeing the ball well, put a couple of good swings on balls and then today it was nice.”\n\nRay (11-8) scattered three hits, struck out seven and walked none. For the month, he allowed six earned runs and struck out 41 over 33 innings. He threw at least six innings in all five starts and permitted two earned runs or less in each one.\n\nThe left-hander escaped the one jam he faced. Andrés Giménez doubled and Austin Hedges followed with a bloop single to open the sixth. With runners at the corners and no outs, Ray got a fly ball from Myles Straw that wasn’t deep enough for Giménez to score, an infield popup from Steven Kwan and then struck out Amed Rosario for the third time to end the threat.\n\nCleveland was blanked for the eighth time this season, while Seattle posted its seventh shutout. During the Mariners' six-game homestand, their starting pitchers went 2-0 with a 1.38 ERA. They had four walks and 39 strikeouts in 39 innings.\n\n“Putting up zeros is the name of the game,\" Ray said. \"I feel like we've been doing a really good job of feeding off each other's energy in our bullpen sessions and in the game. We've got a really good group.”\n\nMoore broke the game open for Seattle with a three-run homer with two outs in the sixth off Civale. France hit a solo shot on the second pitch of the seventh.\n\nSeattle also got a break just before Moore’s long ball. Moore fouled a 2-2 pitch wide of first base where Owen Miller made a leaping attempt into the protective netting to make the catch. But he bobbled the ball against the net and it was ruled out of play.\n\nOn the next pitch, Civale (2-6) left a curveball in the middle of the plate and Moore’s towering drive carried into the left field stands for his first homer since July 7.\n\nCivale matched Ray into the sixth but has gone nine starts since his last victory back in late May. Civale allowed four hits and struck out five.\n\nTRAINER’S ROOM\n\nMariners: SS J.P. Crawford was out of the lineup with an injury to his left pectoral muscle. Servais said after the game that Crawford had an MRI, but nothing major was discovered and he is day-to-day. Crawford had appeared in 115 of 127 games entering Sunday.\n\nUP NEXT\n\nGuardians: Cleveland returns home and, after a day off, will open a series against Baltimore. RHP Cal Quantrill (10-5, 3.59 ERA) starts the opener. Quantrill has won six straight decisions and threw seven shutout innings in his last start against San Diego.\n\nMariners: After an off day, rookie RHP George Kirby (5-3, 3.32) will make his 19th start Tuesday against Detroit. In August, Kirby is 3-0 with a 2.59 ERA and 29 strikeouts over four starts. He allowed one run over seven innings in his last outing.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "4",
		"title": "Guardians solve Mariners bullpen, rally for 4-3 victory",
		"date": "08/27/2022 10:31 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — José Ramírez was bested by a slider from Andrés Muñoz in a key moment during the first game of Cleveland's series against the Seattle Mariners.\n\nGiven the chance to swing at a fastball two days later, Ramírez didn't miss.\n\nRamírez homered and sparked an eighth-inning comeback with an RBI double, Zach Plesac won for the first time since early June and the Guardians rallied for a 4-3 victory Saturday night.\n\nRamírez hit his 26th homer off Seattle starter Luis Castillo in the fourth, then slapped a 101 mph fastball from Muñoz down the left-field line as part of Cleveland’s three-run eighth.\n\n“You can see how good of stuff Munoz has because (Ramirez) doesn't hit the ball down the left-field line that often,” Guardians manager Terry Francona said. “That's a pretty impressive inning for us because that kid is really, really good.”\n\nHow impressive? Seattle was 51-0 this season when leading after seven innings. It was the Mariners' first loss when ahead going into the eighth since Sept. 7, 2021.\n\n“They put the bat on the ball. They found some holes and they put together an inning. It happens once in a while,” Seattle manager Scott Servais said. “I thought Andrés' stuff was fine. You do have to give them credit there.”\n\nThe big inning started with a walk to Steven Kwan and Amed Rosario’s single. Josh Naylor’s RBI groundout and Andrés Giménez’s sacrifice fly capped the outburst for the AL Central leaders, who remained three games in front of second-place Minnesota.\n\nCleveland had scored four runs in the first 27 innings of the four-game series, then plated three against one of the top relievers in the American League.\n\nMuñoz (2-5) struck out Ramírez in the eighth inning of Seattle's 3-1 win on Thursday. The right-hander had not allowed a run in his previous 10 appearances.\n\n“I feel like pitchers when they face me, it's not necessarily one pitch they stick to in particular. They feel like they try to play with my mind, get in my mind,” Ramirez said through a translator.\n\nThe rally handed Plesac (3-11) his first victory since June 5. The right-hander lost his previous seven decisions, but limited the Mariners to three hits over a season-high seven innings and struck out six.\n\n“He competed like crazy and when you look back on it and if he didn’t, we wouldn’t have had a chance,” Francona said.\n\nThe one issue for Plesac was that all three hits he gave up left the yard. Eugenio Suárez homered leading off the second inning for his 24th of the season and rookie Julio Rodríguez hit a towering shot in the third for his 21st.\n\nJake Lamb, who took over at first base after Ty France was ejected, hit his first homer since being traded to his hometown team with a two-out shot in the seventh.\n\nBut that was all Seattle could manage. It was the sixth time in major league history a team had three solo homers to account for all its hits. The Mariners were the first team since at least 1901 to have three home runs but no other baserunners.\n\nFor Rodríguez, it was his first long ball since signing a massive contract that guarantees him $209.3 million and could be worth up to nearly $470 million over the life of the deal.\n\nJames Karinchak pitched the eighth and Emmanuel Clase worked the ninth for his 30th save.\n\n“We pitched well. Those guys capitalized on mistakes I made and the guys came through tonight with the bats late,” Plesac said.\n\nCastillo was dominant for six innings and only a high pitch count ended his night early.\n\nThe right-hander allowed a pair of singles to Kwan, Ramírez’s long ball and a single by Naylor. Castillo finished with 10 strikeouts, getting at least one in every inning and striking out the side in the third. His biggest strikeout was whiffing Rosario with runners at first and third to end the fifth.\n\nSENT AWAY\n\nFrance was ejected by plate umpire Lance Barrett in the middle of the fifth inning. France had been called out on strikes to end the fourth on a borderline pitch and had words for Barrett. After the top of the fifth, France apparently had more words for Barrett and was tossed.\n\nIt was the second straight day Seattle had an ejection, after Jesse Winker and Servais were tossed on Friday.\n\nTRAINER’S ROOM\n\nMariners: INF/OF Sam Haggerty was able to hit in the batting cage before the game and was available off the bench a day after a bunt attempt hit the fingers on his hand.\n\nUP NEXT\n\nGuardians: RHP Aaron Civale (2-5, 5.37 ERA) doesn’t have a win since May 20 and hasn’t had a decision in any of his past five starts. Civale allowed one run over 4 2/3 innings in his last start against San Diego.\n\nMariners: LHP Robbie Ray (10-8, 3.75) looks to continue his excellent August performance. Ray has permitted six earned runs and struck out 34 in 26 innings over four starts this month. He has won his past two starts.\n\n------\n\nAs they try to hang on to their slim lead in the AL Central, the Guardians lost Zach Plesac (broken hand) and Aaron Civale (forearm inflammation) to the 15-day injured list.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n"
	},
	{
		"id": "5",
		"title": "Haniger lifts Mariners over Guardians 3-2 in 11 innings",
		"date": "08/26/2022 11:32 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Mitch Haniger singled home the winning run in the 11th inning and the Seattle Mariners beat the Cleveland Guardians 3-2 on Friday night in a matchup of American League playoff contenders.\n\nCleveland's lead in the AL Central was trimmed to three games over Minnesota, which blanked San Francisco. Seattle is clinging to a postseason spot in a tight wild-card race.\n\n“We’re going to play a lot more games like this coming down the stretch,” said Mariners manager Scott Servais, who was ejected in the eighth. “That’s how we’re built and I feel really good when we get in tight games.”\n\nAfter a tense pitching duel between starters Shane Bieber and Logan Gilbert, the Mariners got a terrific effort from their bullpen and pulled it out.\n\nHaniger hit a leadoff single in the bottom of the 11th on a 2-0 pitch from All-Star closer Emmanuel Clase (2-3) to score automatic runner Dylan Moore from second base.\n\n“I think in the playoffs there’s a lot of close games, so (it) definitely prepares us for them,” Haniger said.\n\nFirst baseman Carlos Santana threw out a runner at the plate in the top of the 11th, and Penn Murfee (4-0) retired Tyler Freeman with the bases loaded to end the inning.\n\n“We have the best defense in the league,” Gilbert said.\n\nThe first four runs of the game scored on sacrifice flies.\n\nBieber, the 2020 AL Cy Young Award winner, struck out nine in seven innings. He allowed two runs — one earned.\n\nGilbert went 6 1/3 innings and permitted two runs on eight hits.\n\nSeattle's bullpen came through all night, highlighted by Matt Festa starting a a 1-4-3 double play in the 10th. Los Bomberos allowed just one hit after Gilbert’s exit.\n\nAdam Frazier's sacrifice fly for Seattle in the seventh tied it at 2.\n\nAfter issuing a leadoff walk to J.P. Crawford in the eighth, Cleveland reliever James Karinchak struck out the next three batters. The last one, Jesse Winker, was steamed about the call and got ejected along with Servais.\n\nHaniger opened the ninth with a double but was stranded at third by Trevor Stephan.\n\nMONEY BALL\n\nRookie outfielder Julio Rodríguez and the Mariners agreed to a $209.3 million contract starting next season that could be worth $309.3 million over 15 years.\n\nThe deal for the 21-year-old All-Star includes seven seasons, a five-year player option, an eight-year club option with award escalators and the possibility the option could extend to 10 years. If Rodríguez earns two MVP awards by 2028 or finishes among the top five in voting four times, the deal could be worth $469.6 million over 17 seasons — including postseason award bonuses.\n\nThe team announced the deal before Rodríguez's at-bat in the sixth, and he received a standing ovation from the crowd of 39,870. The deal is the 26th contract for $200 million or more.\n\nEXTRA EFFORT\n\nSteven Kwan went all out in the fifth for the Guardians and luckily avoided injury. The left fielder made a leaping catch into the stands on Cal Raleigh’s fly ball into foul territory. His legs struck the wall and he fell face-first.\n\nAfter a brief delay, Kwan stayed in left field to finish the inning and then led off the sixth with a single. He scored on Josh Naylor’s sacrifice fly to give Cleveland a 2-1 lead.\n\n“I thought he was really hurt,” Guardians manager Terry Francona said. “I was afraid. After he fell, you don’t know what he hit. So I think we dodged a pretty big bullet there. He said he’s OK. He’s fearless.”\n\nTRAINER’S ROOM\n\nMariners: 1B Ty France was not in the lineup after he left Thursday’s game with a bruised right calf following a collision with José Ramírez at first base. France said he was feeling better. Servais said France would be available off the bench if needed, but the manager was hoping to avoid that and have France back in the lineup Saturday.\n\nUP NEXT\n\nGuardians: RHP Zach Plesac (2-11, 4.43 ERA) looks for his first win since June 5.\n\nMariners: RHP Luis Castillo (5-5, 2.93) makes his fifth start with Seattle since being traded from Cincinnati. He allowed four runs against Oakland on Sunday, the most he’s given up in a Mariners uniform.\n\n------\n\nAs they try to hang on to their slim lead in the AL Central, the Guardians lost Zach Plesac (broken hand) and Aaron Civale (forearm inflammation) to the 15-day injured list.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n"
	},
	{
		"id": "6",
		"title": "Mitch Haniger's homer lifts Mariners past Guardians 3-1",
		"date": "08/25/2022 04:04 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — As the longest tenured members of the current roster, Mitch Haniger and Marco Gonzales expect the Seattle Mariners will have more meaningful games later this season.\n\nThat doesn't diminish Thursday's 3-1 win over the Cleveland Guardians, which was the start of an important stretch against another playoff contender and a potential postseason preview.\n\n“This is what I guess we envisioned. As a player you want it to happen sooner. You’re hoping for this season every year,\" Haniger said. \"But we’re right in the mix.”\n\nHaniger hit a three-run home run in the first inning to account for all of Seattle’s offense and Gonzales tossed six strong innings in the opener of a key four-game series between playoff contenders in the American League. The teams will play six more times over the next 10 days.\n\nJulio Rodríguez walked to open the game and Jesse Winker singled before Haniger stayed hot at the plate, taking Cleveland starter Triston McKenzie deep to left-center field just three batters into the game. Haniger’s fly ball appeared to be a long out off the bat but carried on a warm afternoon.\n\nHaniger has homered in three of the past four games and is hitting .313 in 17 games since coming off the injured list.\n\n“Timeliness of home runs are huge,” Seattle manager Scott Servais said. “Three-run homers are beautiful. They’re awesome. Whatever you want to call them.”\n\nCleveland’s only run off Gonzales (9-12) came in the first when Steven Kwan doubled and scored on José Ramírez’s infield groundball. Gonzales got a key groundout from Josh Naylor to end the first and then settled into a groove.\n\nGonzales retired 16 of his final 18 batters — including 12 straight before walking Ramírez on a 3-2 pitch with two outs in the sixth. Gonzales got Oscar Gonzalez to flail at a 3-2 changeup to end the inning, the last of his four strikeouts and the conclusion to one of his better starts this season.\n\n“I feel relieved because that’s definitely how I felt and to get the result and match up with that feels good,” Gonzales said. “Obviously, I’m not satisfied because I think we have a long way to go.”\n\nAndrés Muñoz struck out Ramírez with runners at first and second to end the eighth inning and struck out a pair in the ninth for his third save.\n\n“I saw 102, and then a slider. That was pretty filthy stuff,” Cleveland manager Terry Francona said. \"I don’t think you have to be in the game for 40 years to know that that was pretty special stuff.”\n\nMcKenzie (9-10) found his own groove after giving up the home run. McKenzie retired 11 straight after the homer and 18 of the final 20 batters he faced, giving up a single to J.P. Crawford and a walk to Carlos Santana.\n\nMcKenzie struck out four and allowed just three hits. Francona said McKenzie woke up with a stiff neck and the team had Bryan Shaw on alert to potentially make an emergency start.\n\n“The first inning didn't look real good, he wasn't locating,” Francona said. “Fortunately, once he got the blood flowing and everything I thought he pitched pretty well.”\n\nBATTERED FRANCE\n\nSeattle 1B Ty France left the game after the second inning with a right calf bruise.\n\nFrance had an awkward collision with Ramirez trying to grab a high throw in the first inning and appeared to have his leg clipped by Will Benson as tried to beat out a grounder in the second inning.\n\n“The calf is my main concern right now,\" France said, then clarified, \"I wouldn’t call it a concern. It’s just where I feel most the pain I guess.”\n\nFrance is tied for the AL lead in hit by pitch and has also had wrist and elbow injuries this season.\n\nTRAINER’S ROOM\n\nMariners: Servais is hopeful IF/OF Sam Haggerty (shoulder) will be back in lineup sometime this weekend. Haggerty came on as a defensive replacement late in Wednesday’s game and as a pinch-runner Thursday. ... LHP Matthew Boyd continues his rehab assignment at Triple-A Tacoma and seems a likely option to join the team when rosters expand Sept. 1, especially with Seattle uncertain if LHP Ryan Borucki (forearm) uncertain to return this season.\n\nUP NEXT\n\nGuardians: RHP Shane Bieber (8-7, 3.10) has won four of his past five starts. He took the loss in his last start against the White Sox despite allowing only one earned run in 6 1/3 innings. Bieber has a 1.62 ERA over those five starts.\n\nMariners: RHP Logan Gilbert (10-5, 3.52) looks for his first victory since July 5. Gilbert is 0-2 with a 5.61 ERA over his past eight starts. Gilbert has not make it through six innings in three of four starts this month.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "7",
		"title": "Langeliers ends A's 81-game triples drought in win over M's",
		"date": "08/21/2022 05:11 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "OAKLAND, Calif. -- — Shea Langeliers got three hits, including Oakland's first triple after a strange 81-game drought without a three-bagger, and the Athletics beat the Seattle Mariners 5-3 Sunday.\n\nNo team in major league history had gone longer without a triple since 1901 until Langeliers, a catcher, hit an RBI drive in the eighth inning. He had two triples this season in Triple-A.\n\nLangeliers hit a drive off the left-field wall to end the spell.\n\n“I got lucky there,” he said. “It kicked really far off the wall. So I just got to keep running.”\n\nJP Sears (5-0) allowed one run, on Mitch Haniger's homer, in five innings. Six A's relievers held the lead for the team with the worst record in the AL.\n\nSeattle, near the top of the wild-card standings, lost for the second straight day to the A's. Cal Raleigh had two doubles for the Mariners.\n\nLuis Castillo (1-1) failed to reach the seventh inning for the first time in four starts since being traded from Cincinnati to Seattle. He yielded four runs and eight hits in five innings.\n\n“I wasn’t 100% in rhythm the whole day,” Castillo said through an interpreter, Mariners third base coach Manny Acta.\n\nThe Mariners went 5-4 on their three-city trip.\n\nA’s manager Mark Kotsay credited his players for doing “a phenomenal job of taking away what Castillo gives you. And you saw that right out of the gate.”\n\nKotsay was ejected in the seventh inning by umpire Bill Miller for arguing on a half-swing.\n\n“I was a little amped up over the checked-swing call,” Kotsay said. “I lost the fact that these guys are human and they make mistakes. My frustration got the best of me, let’s just say that, and he did the right thing by ejecting me.”\n\nSeth Brown, who hit Oakland's previous triple on May 18, doubled and scored on Sean Murphy’s single in the first. A double by Langeliers keyed a two-run second.\n\nHaniger’s fifth homer made it 3-1 in the third. Oakland added a run in the sixth when Tony Kemp dragged a bunt single and later scored on Stephen Vogt’s single.\n\nRaleigh had an RBI pinch-hit double and Julio Rodriguez singled home a run in the seventh.\n\nThe Mariners stranded runners on the corners in the eighth inning, which ended with A’s left-hander Sam Moll coaxing a groundout from Dylan Moore.\n\nRaleigh again doubled with one out in the ninth inning, but Austin Pruitt recorded the final two outs for his first save in two opportunities.\n\nSeattle manager Scott Servais praised his team for rallying, but acknowledged the Mariners lacked the truly big hit.\n\n“Offensively, we talk about ‘when you come back, make the comeback,\" he said.\n\nTRAINER’S ROOM\n\nMariners: LF Sam Haggerty was scratched from the lineup with left shoulder discomfort. Haggerty aggravated this ailment a couple of days ago, Servais said. Moore, who would have started at second base, occupied left field instead while Adam Frazier filled in at second. Haggerty entered the game as a pinch-runner in the eighth.\n\nA’s: CF Ramon Laureano is still “moving forward pretty quickly” in his recovery from a strained left oblique, Kotsay said. Laureano, who hasn’t been in a game since Aug. 14, played catch on Sunday, one day after taking 10 swings with no ill effects ... OF Skye Bolt missed his second start in a row with left knee soreness but felt fit enough to enter the game in the eighth. ... RHP Brent Honeywell’s minor league injury rehabilitation assignment will intensify Tuesday when he becomes available to pitch in relief for Triple-A Las Vegas. Honeywell is on the injured list with a stress reaction in his right elbow.\n\nUP NEXT\n\nMariners: Following Monday’s scheduled off-day, the Mariners face Washington on Tuesday to open a six-game homestand.\n\nAthletics: Host Miami on Monday, with Adam Oller of the A’s opposing right-handed counterpart Pablo Lopez.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "8",
		"title": "Kemp scores winning run on defensive misplay, A's beat M's",
		"date": "08/20/2022 07:50 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "OAKLAND, Calif. -- — It took a little bit of good fortune for the Oakland Athletics to finally beat the Mariners again at home.\n\nTony Kemp scored the winning run after pitcher Diego Castillo mishandled a high chopper by Sheldon Neuse with none out in the 10th inning, and the A's beat surging Seattle 4-3 on Saturday.\n\nSeattle had its four-game winning streak snapped, and also a 10-game run of victories in the Coliseum dating to the A's last win on May 26, 2021 — Oakland's longest skid at home against the Mariners.\n\nNeuse is thrilled to see all the young A's contributing.\n\n“I think it’s huge. For next year, whoever’s going to be here and whoever’s not going to be here, you don’t know, but figure out what people can do,\" he said. \"Let’s see. There’s no reason to look over each other’s shoulders. Just go play ball and figure out what we can do.”\n\nKemp started on second base and Seth Brown was intentionally walked by Castillo (7-2) before Sean Murphy walked to load the bases for Neuse. Castillo reached up and cleanly fielded the bouncer but dropped the ball trying to make the exchange and failed to make a throw home — he might not have gotten Kemp anyway.\n\n“Tony had a great day today on both sides of the ball,” manager Mark Kotsay said.\n\nDany Jiménez (3-4) pitched the ninth and 10th for the win. He is finally healthy again after a shoulder injury and produced his sixth game not allowing a run since returning from the injured list Aug. 2.\n\nEugenio Suárez hit a tying single in the eighth for Seattle against Zach Jackson a day after the Seattle slugger homered twice. Kemp had put the A's ahead on a go-ahead, two-run single in the fifth inning.\n\nA's starter James Kaprielian allowed two runs on three hits, struck out three and walked four in five innings. He is winless in nine home starts this year.\n\nJulio Rodríguez and Suárez hit triples for Seattle against a team that never seems to deliver three-baggers, but the Mariners couldn't hold their early 2-0 lead.\n\nThe A’s, meanwhile, haven’t tripled in 81 games since Brown on May 18 — the longest drought by any team since 1901.\n\nTy France and Adam Frazier followed those big hits with sacrifice flies to give starter Logan Gilbert an early chance. The right-hander ultimately had his winless streak reach eight starts since a win at San Diego on July 5. Gilbert had allowed 16 earned runs over his previous three outings.\n\nSeattle won the opener 10-2 on Friday night and will try to secure another winning series in Sunday’s series finale, having gone 12-3-1 in series over its last 16 sets since June 21. That is the best stretch since the AL-best 116-win 2001 team — the Mariners' last playoff club, too — captured 15 of its final 16 series.\n\nRodríguez tripled to start the game and France's fly moments later gave the Mariners an immediate lead. Rodríguez was originally given a single in the third but it was overturned on replay review, though he added another base hit in the fifth.\n\nNick Allen got the A's on the board with an RBI single in the fifth and Oakland improved to 4-8 against Seattle this season.\n\nTRAINER'S ROOM\n\nAthletics: OF Skye Bolt was a late scratch with left knee soreness after being scheduled to start in right field. ... RHP Brent Honeywell pitched two rehab innings with Class-A Stockton on Friday night in his second minor league appearance since being shut down during spring training in late March with a stress reaction in his pitching elbow. His next outing will be with Triple-A Las Vegas. “The best part about it is I feel good today,” he said. ... CF Ramón Laureano took 15 dry swings in the cage in a key first step in his hitting program while recovering from a strained left oblique. Laureano was pleased with the progress.\n\nUP NEXT\n\nRHP Luis Castillo (1-0, 2.18 ERA) takes the mound for Seattle in the series finale. It's his first career start against the A's after being traded to the Mariners from the Reds before the deadline.\n\nLHP JP Sears (4-0, 1.95) counters for Oakland, having gone 1-0 over two starts since being recalled Aug. 10 from Triple-A Las Vegas.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "9",
		"title": "Suarez's 2 homers, 5 RBIs lead Seattle to 10-2 win over A's",
		"date": "08/19/2022 09:44 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "OAKLAND, Calif. -- — Eugenio Suarez homered twice and drove in five runs as the Seattle Mariners cruised to their fourth straight win, 10-2 over the Oakland Athletics on Friday night.\n\nMarco Gonzales (8-12) allowed two runs over 5 1/3 innings and beat Oakland for the third time this season.\n\nSeattle maintained a half-game lead over Toronto for the AL’s top wild card spot. The Mariners (66-54) are 37-15 over their last 52 games, best in the league over that span.\n\nSuarez went deep twice off left-hander Cole Irvin (6-11), hitting a two-run homer in the fourth that put Seattle ahead 3-2 and then lining a three-run shot to center in the sixth to make it 6-2. Suarez has 22 homers this season, his first with Seattle, and 151 since 2018, the most in the majors during that span.\n\nHe also leads the majors in strikeouts with 158. But Mariners manager Scott Servais said Suarez is a huge boost because of his power and personality.\n\n“He is streaky, you know? We knew that when we acquired him,” Servais said. “(But) he really controls the strike zone pretty well. He takes his walks. He just got the experience. He’s a fun guy to be around.”\n\nOakland scored twice off Gonzales in the first to take a 2-1 lead but went silent after that, losing to Seattle for the 20th time in 23 meetings. That includes 10 straight to the Mariners at the Oakland Coliseum, tied for the team’s second-longest home losing streak to one team since the franchise moved to Oakland in 1968.\n\nIrvin was tagged for six runs, five earned, over six innings, but shortstop Nick Allen misplayed a potential inning-ending double play in the sixth that preceded Suarez’s three-run shot.\n\n“I thought outside of one hitter in that lineup that did all the damage, Cole pitched great,” A’s manager Mark Kotsay said. “We make a play defensively for him in the sixth inning, we’re out of the inning. So the line looks bad, but he pitched way better than the line.”\n\nThe A’s trailed 6-2 when they loaded the bases with one out in the sixth. But Matt Brash relieved Gonzales and struck out pinch-hitter Vimael Machin and retired another pinch-hitter, Tony Kemp, on a fielder’s-choice grounder.\n\nRUIZ PROMOTED\n\nOakland promoted reliever Norge Ruiz, making him the 10th rookie on the A’s current 13-man pitching staff. The right-hander had a rough major league debut, allowing four runs, two earned, on six hits in 1 2/3 innings. Ruiz was a high-profile international signee out of Cuba in 2016, getting a $2 million signing bonus from Oakland, but he’d posted a 5.08 ERA over four-plus minor league seasons until cutting down on the walks this season and earning his first trip to the majors.\n\nTRAINER’S ROOM\n\nMariners: LHP Matthew Boyd (flexor tendon strain) has turned in two scoreless one-inning relief appearances in his rehab assignment with Triple-A Tacoma. He’ll extend to two innings in his next outing, Servais said. Boyd could join Seattle’s bullpen in the next week or two.\n\nAthletics: RHP Paul Blackburn (torn finger tendon) said he pitched through pain during his final four starts before being shut down for the season Tuesday. A first-time All-Star this season, Blackburn injured his right middle finger before his July 13 start at Texas. He said the discomfort progressively got worse and affected his ability to extend his finger and finish pitches. “I was hoping that it would just kind of go away,” he said. “... It just never went away. It got worse.” His finger will be in a cast for six to eight weeks, but he’s expected to be at full strength for spring training.\n\nUP NEXT\n\nMariners RHP Logan Gilbert (10-5, 3.51 ERA) takes the mound Saturday looking to snap a seven-start winless streak. He’s allowed 16 earned runs over his past three starts. The A’s counter with RHP James Kaprielian (3-7, 4.33), who is 0-4 with a 4.70 ERA in eight home starts this season.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "10",
		"title": "Mariners overcome Ohtani's 4 hits, sweep Angels 11-7",
		"date": "08/17/2022 04:36 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ANAHEIM, Calif. -- — Shohei Ohtani's latest one-man show for the Los Angeles Angels included a two-run homer, a run-scoring triple, four hits and four RBI.\n\nOhtani is a two-way superstar, but he's only one man — and the Seattle Mariners didn't have much trouble with the other 25 Angels while completing an impressive series sweep.\n\nCal Raleigh homered twice, Eugenio Suárez and Jesse Winker each hit a two-run shot, and the Mariners overcame Ohtani's excellence for an 11-7 victory over the Halos on Wednesday.\n\nRaleigh had the first multi-homer game of his career with a solo shot in the fifth inning and a two-run homer in the ninth for the Mariners, who moved into the top AL wild-card slot while scoring 25 runs in three straight wins at the Big A. Seattle is an AL-best 36-15 since June 21.\n\nOhtani went 4 for 5, hitting his 27th homer in the ninth after he tripled in the seventh and got two singles earlier in his latest outstanding day at the plate. The AL MVP’s fourth career four-hit game — his first since June 2019 — gave him seven hits in the last two games.\n\nAnd in yet another reprise of the major theme in Ohtani’s stateside career, both of those games were blowout losses as the Mariners swept a three-game series at Angel Stadium for the first time since September 2016.\n\n“Yeah, Ohtani was on everything,” Seattle manager Scott Servais said. “They kept coming back on us, but we did some awesome stuff offensively.”\n\nCarlos Santana had a two-run single during the Mariners’ four-run third inning, and George Kirby (5-3) pitched six-hit ball into the sixth while getting ample run support in his third consecutive victory.\n\n“It’s really cool to see those guys getting after it,” Kirby said. “Some guys are hitting their strides. Going to be fun down the stretch, for sure.”\n\nLuis Rengifo added an RBI double before leaving with low back tightness for the Angels, who had won five of six until getting flattened in the path of Seattle’s push toward a playoff spot.\n\nAt least Los Angeles got good news before the game when Mike Trout said he plans to return this weekend from a five-week injury absence, but the long-struggling club ended the day by getting swept in a series for the first time since the All-Star break.\n\nAfter spot starter Touki Toussaint (1-1) opened with two scoreless innings for the Angels, six Mariners reached base against him in the third. Mitch Haniger had an RBI single and J.P. Crawford drew a bases-loaded walk before Santana chased Toussaint.\n\n“They've got really good hitters over there that don't chase much,” Angels interim manager Phil Nevin said of the Mariners. “When you don't put it over the plate or you're behind in the count, you can get hurt.”\n\nSuárez hit his 20th homer and Raleigh followed with his 17th in the fifth before Winker added his two-run shot in the sixth, all off reliever Mike Mayers.\n\nRengifo followed Ohtani's RBI single with a run-scoring double in the fifth. Ohtani then tripled and scored on Taylor Ward's flyout.\n\nDROUGHT RELIEF\n\nSeattle has the majors’ longest postseason drought at 20 years, while the Angels’ current seven-year drought — tied with Detroit — will become the longest in the sport if the Mariners and Philadelphia stay on track to reach the postseason this October.\n\nTRAINER'S ROOM\n\nAngels: Rengifo didn't return to the field in the eighth after grounding out in the seventh. Nevin said he expects to play Friday. Rengifo has been the Angels' best hitter for most of the summer, getting a hit in 41 of his last 47 games. ... Trout intends to return to the lineup Friday in Detroit. The three-time AL MVP has missed 30 games since July 12 with an injury to his upper back and ribcage, but he was determined not to have an early end to his second consecutive season after playing in only 36 games last year. The Halos likely will have to release a player to put Trout back on the roster.\n\nUP NEXT\n\nMariners: After a day off that will include a golf outing for several M's, Marco Gonzales (7-12, 4.18 ERA) takes the mound at Oakland on Friday to open a three-game weekend series.\n\nAngels: After a day off, hard-luck left-hander Patrick Sandoval (3-8, 3.42 ERA) takes the mound at Detroit on Friday to open a 10-game trip.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "11",
		"title": "Mariners break up perfect game bid in 6th, beat Angels 8-2",
		"date": "08/16/2022 09:48 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ANAHEIM, Calif. -- — Adam Frazier broke up José Suárez’s bid for a perfect game in the sixth and added a two-run triple in the ninth, leading the Seattle Mariners to an 8-2 victory over the Los Angeles Angels on Tuesday night.\n\nTy France had a tying two-run single in a three-run sixth for the Mariners, who have won five of seven after a pair of eventful victories at the Big A.\n\nSuárez (4-5), the Angels’ 24-year-old Venezuelan left-hander, retired Seattle’s first 16 batters and led 2-0 before Frazier’s one-out infield single in the sixth. The next three Mariners also singled, abruptly ending Suárez's night.\n\n“He's been pitching really well, but we were able to get a couple of good swings and then get some momentum,” France said.\n\nFrance, who grew up in the Los Angeles suburbs north of Angel Stadium, chased Suárez before Jesse Winker added a tiebreaking sacrifice fly off Jimmy Herget.\n\nFrazier tripled into the right field corner and then scored on Sam Haggerty’s infield hit in the ninth off Jesse Chavez. Rookie Julio Rodríguez added a two-run homer, his 19th of the season, in the Angels' second straight catastrophic ninth inning against the M's.\n\n“At some point, our offense had to break through,” said Robbie Ray, who pitched six innings of six-hit ball for Seattle. “Lately, it's been later in the game. ... We're not really looking at the standings, not looking forward to playoffs or whatever. Our focus needs to be on winning the next game.\"\n\nSeattle scored four runs in the ninth Monday night to win 6-2.\n\nLuis Rengifo homered and drove in two runs for the Angels, who have lost two straight after winning five of their previous six. Shohei Ohtani had a triple and two singles in his 28th multi-hit game of the season.\n\nSuárez also lost his three-start winning streak and his streak of 23 consecutive innings over four starts without allowing an earned run. He began the season in the Angels’ rotation after pitching superbly down the stretch in 2021, but he was demoted to the minors this spring before returning with a new changeup and a serious upgrade in performance.\n\n“Our at-bats once we got past the fifth inning, I thought, were much better,” Seattle manager Scott Servais said. “Credit to Suárez. We have not done much against him.”\n\nRay (9-8) struck out 10, and his teammates' late rally put him in position for his first win since July 15 and his third victory over Los Angeles this season.\n\nRay dominated in his first two starts against the Angels this season with just two earned runs allowed in 14 innings. He wasn't quite as sharp early in Anaheim, but settled in to retire 10 of his final 12 batters.\n\nRengifo extended his impressive August with a solo homer in the first and an RBI single in the third.\n\nSuárez struck out five in his first five innings and didn't even need an exceptional defensive play to stay perfect. Frazier broke through with a grounder into the hole at shortstop, where David Fletcher fielded it on the run with no chance to make the throw.\n\nAILING ANGELS\n\nOF Mike Trout is near a return from his back injury after taking batting practice last weekend. Interim manager Phil Nevin said the team will let Trout decide when he wants to return, but it's more likely to be this weekend in Detroit than on Wednesday. ... RHP Michael Lorenzen (shoulder) threw a three-inning simulated game. He expects to make two starts for Triple-A Salt Lake next before returning to the Angels' rotation next month. ... OF Jo Adell sat out after his thumb was hit by a pitch in the ninth inning Monday. Adell swung a bat during Lorenzen's simulated game, but couldn't throw.\n\nUP NEXT\n\nGeorge Kirby (4-3, 3.39 ERA) takes the mound for Seattle on Wednesday in the series finale. The Angels haven't announced a starter.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "12",
		"title": "Mariners score 4 in 9th after Ohtani departs, top Angels 6-2",
		"date": "08/15/2022 10:21 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ANAHEIM, Calif. -- — Shohei Ohtani turned in his usual strong start. Long after he was gone, things were anything but normal.\n\nThe Seattle Mariners scored four runs in a chaotic ninth inning, taking advantage of the Angels' fielding woes for a 6-2 victory over Los Angeles on Monday night.\n\n“There's a lot to unpack. What started out as very normal game with two good starting pitchers out there got crazy at the end,” Seattle manager Scott Servais said.\n\nJesse Winker and J.P. Crawford each had two hits and two RBI for the Mariners, who vaulted over Toronto and Baltimore into the top wild-card spot in the AL.\n\nWinker, who homered in the first inning, has reached base in 12 of his last 13 games and also has four home runs in that span.\n\nOhtani struck out eight and allowed two runs in six innings. It was the first time since May 18 at Texas that the AL MVP had a no-decision. The Japanese two-way phenom had gone 7-5 with a 2.60 ERA in his last 12 starts.\n\n“The biggest flaw today is that I threw too many balls,” said Ohtani through interpreter Ippei Mizuhara.\n\nThe Angels had far bigger flaws after he departed.\n\nThe game was tied at 2 going into the ninth inning before the Mariners broke through. Sam Haggerty got aboard with a one-out single off Aaron Loup (0-4). Haggerty advanced to second when Angels catcher Max Stassi wildly threw to the bag even though Haggerty wasn’t running. Haggerty stole third and then scored the go-ahead run on another fluky play.\n\nWith runners at the corners, Julio Rodriguez hit a line drive directly at Luis Rengifo. The normally sure-handed Rengifo, who was at second base after David Fletcher left with an injury, dropped the liner and threw home. Haggerty was caught in a rundown but ended up scoring when no one was covering home plate.\n\n“My first thought was to keep us in the inning and stop the double play. I saw Rengifo drop it and my first thought is to get a throw home,” said Haggerty, who described the entire inning as chaotic. “I wanted to stay in the rundown to give our runners another chance to advance. I turn my head and don’t see anyone at home, and I went for it.”\n\nSeattle got some breathing room when Dylan Moore scored on Ty France’s grounder, after Stassi was unable to hold onto the throw to the plate for his second error of the inning. Rodriguez scored on Winker’s grounder and Crawford’s base hit plated France.\n\n“It was awful. We made some bad decisions, throws, didn’t execute a rundown. Yeah, wasn’t good,” Angels interim manager Phil Nevin said.\n\nOhtani threw 97 pitches, including 67 strikes. His pitch arsenal included a season-high 52 fastballs and he threw a 2-seam fastball for the first time this season in a game (six pitches). Ohtani said it was something he had been working on during bullpen sessions and he wanted to try it out in a game.\n\nRengifo homered while Jared Walsh had two hits and an RBI.\n\nAndres Munoz (2-4) got the win.\n\nLuis Castillo, making his third start since being acquired from Cincinnati at the trade deadline, struck out nine in six innings.\n\nThe teams traded two-out solo homers in the first. Winker went deep to right center on a full-count slider by Ohtani. It was the fifth time Ohtani allowed a home run in the opening frame and the first since he gave up a pair against the Yankees on June 2.\n\nRengifo tied it with the help of Seattle's outfield. Center fielder Rodríguez tried to call off right fielder Mitch Haniger, but both players jumped at the ball in right-center. The ball bounced off Rodriguez's glove and over the yellow line, giving Rengifo his eighth homer of the season. It was originally ruled a triple before being overturned by replay.\n\nMORE CHAOS\n\nThe ninth inning also included plate umpire Laz Diaz losing track of the count on Carlos Santana's at-bat. Instead of it being 2-2, Diaz changed the count to 3-1.\n\n“Yeah. I messed that one up,\" Diaz said in a pool report.\n\nAfter the fourth pitch, Santana asked him if he was at 3-1: “I said, no it’s 2-2. Then I started thinking, maybe it is 3-1, because I forgot I called that first pitch a strike,\" Diaz said. \"There were so many pitches going on, I lost the count on that first pitch. I knew I called a strike on the steal, and that’s the only one I remembered. I couldn’t remember the one before that.”\n\nDiaz said the Angels could have challenged the revised count but didn't.\n\nOHTANI WATCH\n\nOhtani has 165 strikeouts, which is tied for fifth in the majors. That’s the third-most strikeouts through the first 20 starts of the season by an Angels pitcher, behind only Nolan Ryan, who had 211 in 1977 and 182 in 1973.\n\nTRAINER'S ROOM\n\nAngels: CF Mike Trout (left ribcage inflammation) took live batting practice, ran the bases and did some defensive drills before the game. There is a possibility that the three-time AL MVP could be activated before the start of a 10-game road trip on Friday. ... Fletcher was removed from the game in the seventh inning due to a left foot contusion.\n\nUP NEXT\n\nMariners: LHP Robbie Ray (8-8, 3.90 ERA) faces the Angels for the third time this season.\n\nAngels: LHP José Suarez (4-4, 4.04 ERA) is 4-1 in nine career games (seven starts) vs. the Mariners.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "13",
		"title": "Seager, Sborz lead Rangers past Mariners 5-3",
		"date": "08/14/2022 02:54 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ARLINGTON, Texas -- — Corey Seager doubled twice and scored twice, including the tiebreaking run in the seventh inning, as the Texas Rangers beat the Seattle Mariners 5-3 on Sunday to win the three-game series.\n\nJosh Sborz (1-0) struck out five of the seven batters he faced in the seventh and eighth innings, including all three in the eighth, and allowed only one walk. The five strikeouts were a career high, and the two innings matched his career-long outing through four seasons.\n\n“He’s got closer stuff,” Texas manager Chris Woodward said. “That second inning was about as good as you can execute.”\n\nThe Rangers won two straight over the Mariners after losing nine consecutive games to Seattle.\n\nIt was the first series loss for the Mariners to an opponent other than Houston since mid-June. They remain in the second wild-card position in the American League.\n\nSborz’s outing following his first big league start on Friday night against Seattle as an opener, during which he took a liner off his right biceps in his only inning.\n\n“I was fortunate it didn’t hit any lower, on any bone,” Sborz said. “Today it felt a lot better.”\n\nJose Leclerc pitched a perfect ninth inning for his first save since the delayed opening day in July 2020. After pitching one more game then, Leclerc missed the rest of the season and all of 2021 with multiple arm injuries.\n\nSeager doubled to left field with two outs in the seventh, reached third on a wild pitch by Matt Brash (3-4) and scored on Adolis Garcia’s single. Nathaniel Lowe followed with his second double of the game, a ground-rule version to left, off Erik Swanson to score Seager.\n\nThe Mariners pulled even 3-all in the sixth when Julio Rodriguez reached on a throwing error by Seager at shortstop, allowing J.P. Crawford to score.\n\nTexas regained the lead 3-2 in the fifth when Seager doubled, advanced to third on a groundout and scored on a wild pitch that bounced in front of the plate.\n\nMitch Haniger’s fifth-inning single that scored Dylan Moore to tie the score at 2 and extend his hitting streak to 11 games. That’s three games in late April before he was sidelined 88 games by an ankle injury and eight games since his return on Aug. 6.\n\nBubba Thompson gave the Rangers a 2-1 lead with a single that scored Lowe and Meibrys Viloria.\n\nSeattle scored first on Sam Haggarty’s single through the hole on the left side to bring home Crawford.\n\nRangers starter Martin Perez allowed three runs — one earned — in six innings while throwing 105 pitches. He struck out seven and walked a season-high five.\n\nMariners starter Logan Gilbert gave up three runs on five hits in six innings, striking out four and walking four.\n\nGilbert went into play with a 1.02 ERA against Texas this season in 17 2/3 innings over three previous starts.\n\nTHIS JUST IN\n\nA scoring change made Saturday from Thursday’s Rangers-White Sox game following a Texas challenge resulted in a new first career hit for Rangers OF Bubba Thompson. His fifth-inning grounder was initially scored an error.\n\nThe baseball was saved by assistant clubhouse manager Dave Bales in case the ruling was changed and was presented to Thompson on Saturday.\n\n“I had forgotten about it,” Thompson said. “I’ll take it.”\n\nSHORT HOPS\n\nLowe has a 20-game on-base streak, longest by a Ranger this season. … C Curt Casali made his Mariners debut, going 0 for 2 with a walk and a strikeout. Casali was acquired Aug. 2 from San Francisco and came off the injured list (right oblique strain) Thursday. … Rangers LHP Matt Moore began three days’ paternity leave. Moore was replaced by RHP Yerry Rodriguez, who was recalled from Triple-A Round Rock and hasn’t appeared in a big-league game.\n\nTRAINER’S ROOM\n\nRangers RHP Joe Barlow (blister) was scheduled to pitch Sunday night for Double-A Frisco in a rehab assignment.\n\nUP NEXT\n\nMariners: RHP Luis Castillo (5-4, 2.71 ERA) will make his third start with the club and face Angels RHP Shohei Ohtani (10-7, 2.68) to begin a three-game series in Anaheim.\n\nRangers: RHP Glenn Otto (4-8, 5.20) will open a four-game home series against Oakland on Monday night against RHP James Kaprielian (3-6, 4.38). Otto is 0-6 in his last nine starts.\n\n------\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\nSeattle Mariners (73-58, second in the AL West) vs. Cleveland Guardians (68-61, first in the AL Central)\n\n"
	},
	{
		"id": "14",
		"title": "Seager 26th HR matches career high as Rangers beat M's 7-4",
		"date": "08/13/2022 07:44 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ARLINGTON, Texas -- — With a bunt, a blast and some grittiness, the Texas Rangers finally snapped a long losing streak against the surging Seattle Mariners.\n\nCorey Seager matched a career high with his 26th homer after rookie Bubba Thompson drove in a run with a sacrifice squeeze bunt as the Rangers overcame an early three-run deficit in a 7-4 victory Saturday night. The Mariners had won nine in a row against their AL West rival.\n\n“We got a little gritty there,” manager Chris Woodward said. “It’s something we’ve been talking a lot about, finding ways to get back in games, finding a way to fight in the game ... and down 3-0, this team’s had our number.”\n\nEugenio Suárez homered and had a sac fly for the Mariners, whose nine wins in a row over Texas were their most ever — and matched the longest in-season losing streak by the Rangers against a single opponent. Seattle has won 12 of 15 in the season series, with four games to play.\n\nThe Rangers went ahead to stay with a four-run outburst in the fourth inning against Marco Gonzalez (7-12), who they faced for the fifth time already this season. That was capped by Thompson’s bunt pushed to the right side as Charlie Culberson crossed home plate.\n\n“They were on him. I mean, they got some hits, there were some balls hit hard, and some that weren’t hit hard. That’s what happens when you put a big number up there,” Seattle manager Scott Servais said. “It happened pretty quick, and it was a matter of about 14, 15 pitches.”\n\nAdolis Garcia stretched his hitting streak to 10 games with a one-out double and scored when Jonah Heim followed with a double. Nathaniel Lowe had an opposite-field bloop hit to shallow left, then Culberson and Ezequiel Durán had back-to-back RBI singles before Thompson’s bunt.\n\n“His stuff was fine, they found some holes,” Servais said of Gonzales, who allowed five runs in five innings.\n\nThe Mariners lost for only the 14th time in their last 47 games overall since mid-June. They dropped a half-game behind Toronto for the American League’s top wild card.\n\nSeager, in the first season of his $325 million, 10-year contract with Texas, went deep in the fifth with a solo shot pulled down the right-field line that made it 5-3. He had 26 homers for the Los Angeles Dodgers in 2016, when he was the National League rookie of the year in his first full season.\n\nBrett Martin (1-7) got the win after facing only one batter. The left-hander got an inning-ending double play grounder in the fifth after replacing Dane Dunning. Hard-throwing right-hander Jonathan Hernandez worked a perfect ninth for his third save in three chances.\n\nSeattle opened the game with consecutive singles off Dunning, and led 2-0 after a wild pitch and a sac fly by Suárez. Cal Raleigh had a leadoff double in the second and scored on a sac fly by Sam Haggerty.\n\nDunning, who in his last start snapped a 15-start winless span since April 30, walked the leadoff hitter in the fifth after being given a 4-3 lead and the chance for another victory. But he was pulled after striking out Mitch Haniger on his 101st pitch.\n\n“Fell behind on practically everything. I just wasn’t really competitive in the zone throughout the game,” Dunning said. “Very frustrating for me. The one thing I will say that is, the team had my back, was able to put together a good rally. Just wish I could’ve done better for them.”\n\nSHORT HOPS\n\nFormer Rangers second baseman Ian Kinsler and longtime communications director John Blake were inducted into the team's Hall of Fame during a pregame ceremony. ... Haniger has hit safely in all seven games for Seattle since being reinstated from the 60-day injured list on Aug. 7. He is hitting .423 (11 of 26) in that span, and has a 10-game hitting streak overall. ... Lowe had two singles and has reached base safely via a hit or a walk in 19 consecutive games. That is the longest streak by a Texas player this season.\n\nTRAINER’S ROOM\n\nMariners: OF Taylor Trammell was reinstated from the 10-day injured list and optioned to Triple-A Tacoma. Trammell hit .235 with three homers and nine RBI over 32 games before going on the IL on June 28 because of a right hamstring strain.\n\nRangers: Reliever Josh Sborz felt fine a day after taking a liner off his upper right arm.\n\nUP NEXT\n\nAll-Star left-hander Martín Pérez (9-3, 2.85 ERA), coming off his first loss in 20 starts since April, pitches the series finale for Texas. Right-hander Logan Gilbert (10-5, 3.47) will be on the mound for the Mariners.\n\n------\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\nSeattle Mariners (73-58, second in the AL West) vs. Cleveland Guardians (68-61, first in the AL Central)\n\n"
	},
	{
		"id": "15",
		"title": "Julio Rodriguez returns to lineup, Mariners beat Rangers",
		"date": "08/12/2022 09:07 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ARLINGTON, Texas -- — Star rookie Julio Rodriguez got two hits in his return to the Seattle lineup and the Mariners took over the first wild-card position in the American League by beating the Texas Rangers 6-2 on Friday night.\n\nThe 21-year-old Rodriguez, who put on an impressive show in the All-Star Home Run Derby, had missed the Mariners’ previous 11 games with a wrist injury.\n\nRodriguez hit a tiebreaking, opposite-field single to shallow right with the bases loaded in the fourth inning. He was the first batter to face Jose Leclerc, who relieved Taylor Hearn (5-7).\n\nRodriguez hit a grand slam off Leclerc at Globe Life Field on July 15.\n\n“I just felt good,” Rodriguez said. “I just went out there and competed. I wasn’t worried about anything.”\n\nRodriguez also sent 400-foot shot nearly over the left-field foul pole in the sixth that was ruled foul, even after a Seattle challenge.\n\n“I thought it went over,” Rodriguez said. “They should put (the pole) higher.”\n\nGeorge Kirby (4-3) allowed two runs in 5 2/3 innings on seven hits with five strikeouts and one walk. It was the rookie’s second straight win.\n\nThe victory, combined with Toronto’s loss to Cleveland, gave the Mariners a half-game lead over the Blue Jays.\n\nThe Mariners are a season-best 10 games over .500 and are 12-2 with nine consecutive wins this season against the Rangers, who dropped to a season-low 14 games under .500.\n\nSeattle took a 4-2 lead into the ninth inning and Eugenio Suarez added a two-run double.\n\nThe Rangers scored on Marcus Semien’s groundout in the third and Jonah Heim’s single in the sixth.\n\nTexas used a bullpen game with Josh Sborz making his first start in 88 big league appearances.\n\nSborz took a liner off his upper right arm during the game’s third batter, Mitch Haniger. Sborz finished the inning with one more pitch and was replaced in the second by Hearn, the first of five Texas relievers.\n\nRangers manager Chris Woodward said Sborz was obviously sore but the pitcher’s status won’t be clear until being examined Saturday.\n\nThe Rangers’ first hit was Nathaniel Lowe’s infield single leading off the second, but he was doubled off first to end the inning following a running, leaping catch by Haniger at the wall in right field on a ball hit by Leody Taveras.\n\n500TH CAREER WIN FOR SERVAIS\n\nSeattle manager Scott Servais’ voice cracked as he talked about the milestone victory.\n\n“It’s really hard to do – and not get fired,” he said with a laugh. “It’s a credit to our players. I said that to them when they dumped the Gatorade or whatever on me.”\n\nEARLY EXIT\n\nWoodward was ejected by Jerry Meals, the plate umpire and crew chief, in the bottom of the fourth inning during Adolis Garcia’s leadoff at-bat. It was Woodward’s first ejection this season.\n\nSHORT HOPS\n\nSeattle was 3 for 12 with runners in scoring position, Texas 1 for 6. … Lowe has an 18-game on-base streak, the longest by a Ranger this season. … Haniger had three singles and is 10 for 22 in six games since returning from an ankle sprain that sidelined him since late April. … The Mariners designated RHP Ken Giles for assignment.\n\nTRAINER’S ROOM\n\nMariners: C Curt Casali (oblique) returned from the 10-day injured list Thursday. Casali was acquired from San Francisco on Aug. 2 and hasn’t appeared for Seattle.\n\nRangers: OF Kole Calhoun (right heel irritation) is feeling better, but Woodward isn’t sure when he can return.\n\nUP NEXT\n\nMariners: LHP Marco Gonzales (7-11, 3.98 ERA) will make his fifth start vs. Texas this season on Saturday. He’s 1-1 with a 4.38 ERA in those games, which the M’s and Rangers split.\n\nRangers: RHP Dane Dunning (2-6, 4.04) won last Saturday for the first time since April 30, shutting out the Chicago White Sox over seven innings on one hit and one walk.\n\n------\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\nSeattle Mariners (73-58, second in the AL West) vs. Cleveland Guardians (68-61, first in the AL Central)\n\n"
	},
	{
		"id": "16",
		"title": "Santana's homer rallies Mariners for 4-3 win over Yankees",
		"date": "08/10/2022 04:19 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — In a clubhouse with little experience of being in a playoff chase, Carlos Santana is the old guy that can be turned to for advice and guidance.\n\nAnd sometimes he comes up with a clutch hit or two as a reminder he's still pretty good player.\n\nSantana snapped an 0-for-17 slump with a go-ahead two-run homer during Seattle's three-run seventh inning, and the Mariners rallied to beat the slumping New York Yankees 4-3 on Wednesday.\n\n“I trust Carlos in a number of different areas, certainly on the field, the pedigree and the experience level,” Seattle manager Scott Servais said. “I also trust him a lot in the clubhouse.”\n\nThanks to two tense, one-run victories, Seattle took two of three from New York for the second straight week to win the season series 4-2. The Mariners won 1-0 in 13 innings on Tuesday night. With the Yankees leading the AL East and Seattle in the first AL wild-card spot, the teams could meet again in the playoffs.\n\nAaron Judge hit his major league-leading 45th homer of the season for the Yankees, who have lost eight of 10.\n\n“I think they're really good. They can pitch, obviously have some good starters, but their bullpen is about as good a bullpen as we faced,” New York manager Aaron Boone said of Seattle. “They can mix and make, they got right and left in their lineup. Obviously they're going to get (Julio) Rodriguez back. That team certainly feels for real.”\n\nSeattle has not lost a series to a team other than AL West-leading Houston since mid-June, when it dropped four of five to the Los Angeles Angels. Seattle is 10-10 since the All-Star break, a challenging stretch that including 13 games against Houston and New York.\n\nSeattle improved to 27-14 in one-run games.\n\n“I think we just play so many of them that we’re more comfortable in them than other teams,” said Seattle reliever Paul Sewald, who pitched the ninth for his 15th save. “Those guys blow people out all the time. Playoffs are going to be tight and we’re really good at one run games. We’re just comfortable playing in them.”\n\nKyle Higashioka hit a go-ahead, two-run homer on the 115th and final pitch from Seattle starter Robbie Ray in the seventh to snap a 19-inning scoreless streak for the Yankees, and Judge's longball against Penn Murfee (3-0) made it 3-1 later in the frame.\n\nMurfee then retired DJ LeMahieu and Anthony Rizzo, Diego Castillo pitched a perfect eighth, and Sewald worked the ninth.\n\nRay and New York starter Nestor Cortes were both terrific, following standout performances Tuesday night from the Yankees' Gerrit Cole and the Mariners' Luis Castillo.\n\nCortes struck out 10 and didn't allow a hit until Sam Haggerty homered off the left-field foul pole with one out in the sixth.\n\n“It was a fastball away I yanked into the bottom of the zone where he crushes the ball,” Cortes said. “Just a mistake pitch.”\n\nCortes was lifted after giving up consecutive singles to Ty France and Mitch Haniger to open the seventh. Haniger's hit scored France to make it 3-2.\n\n“He just couldn't put those last two guys away,” Boone said.\n\nAlbert Abreu (2-2) struck out Eugenio Suarez but left a changeup in the middle of the plate and Santana didn’t miss, hitting his seventh home run since being acquired by Seattle in June.\n\n“It’s a long season, up and down, but my head never gets down. I’m strong mentally. My mentality now is try to help my teammates finish strong.”\n\nThe 36-year-old Santana reached the playoffs in four seasons with Cleveland.\n\nRay allowed three hits and two runs in 6 1/3 innings. He struck out seven but walked a season-high five.\n\n“I overheard it on the broadcast last night — that’s like a couple playoff teams going at it in a playoff series,” Ray said. That’s what it felt like. ... It seemed like it was punch for punch, every single pitch, every single inning.\"\n\nROSTER SHUFFLE\n\nSeattle optioned OF/DH Kyle Lewis and LHP Brandon Bernardino to Triple-A Tacoma to clear roster spots for the return of Diego Castillo and utilityman Dylan Moore.\n\nLewis, the 2020 AL rookie of the year, struggled badly at the plate after returning from a concussion. Lewis was hitting .098 with 18 strikeouts in his previous 46 plate appearances.\n\n“Kyle’s tool is the bat and it has been a struggle since he came back up here. Recently, the strikeout has crept in. I do think there’s a role for him on our club. But you need to be productive,” Servais said.\n\nSeattle is also moving RHP Chris Flexen to the bullpen. The Mariners picked up a sixth starter when they acquired Luis Castillo at the trade deadline. Servais said Flexen may come back into the rotation later in the season as Seattle monitors the innings of rookie George Kirby.\n\nTRAINER’S ROOM\n\nYankees: IF Matt Carpenter is expected to miss at least six weeks due to his fractured left foot suffered in Monday's series opener. Carpenter saw a specialist in Seattle on Wednesday morning. ... Rizzo returned to the lineup after missing the previous five games with lower back issues.\n\nMariners: Seattle remains hopeful CF Julio Rodriguez (wrist) will be activated off the injured list before Friday’s series opener in Texas. ... SS J.P. Crawford was given the day off.\n\nUP NEXT\n\nYankees: RHP Domingo German (1-2, 5.09 ERA) will start the opener of a three-game series at Boston on Friday.\n\nMariners: Seattle has not announced its rotation for the series at Texas that begins Friday.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "17",
		"title": "Lucky 13: Mariners top Yankees in extras for tense 1-0 win",
		"date": "08/09/2022 11:44 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — After four hours of dominant pitching, some bad baserunning and slick defense, Luis Torrens and the Seattle Mariners finally broke through.\n\nTorrens singled with one out in the 13th inning to score Eugenio Suárez, and the Mariners beat the New York Yankees 1-0 on Tuesday night in a game dominated by the starting pitching of Gerrit Cole and Luis Castillo.\n\n“That’s one of the best major league games I’ve ever watched. The pitching in this game was unbelievable on both sides,” Seattle manager Scott Servais said.\n\nThe two aces were overpowering into the late innings before turning it over to bullpens that managed to keep the game scoreless deep into the night.\n\nSome poor baserunning by the Yankees helped, as did a lack of execution by the Mariners as both teams had chances early in the extra frames.\n\nIt was the first major league game to reach the 13th inning scoreless since Tampa Bay against Detroit on Aug. 17, 2019 — before new rules were implemented in 2020 putting an automatic runner at second base to start each extra inning.\n\nAnd it had a playoff feel, with fans standing for most of the final five innings.\n\n“That was the coolest game I’ve ever been a part of,” said Seattle reliever Matt Brash. “Obviously, I’m new in the big leagues, but I mean, that atmosphere is what we want.”\n\nEventually, the Mariners came through in the 13th. Cal Raleigh singled off Jonathan Loáisiga (1-3) and advanced Suárez from second to third. One out later, Sam Haggerty was intentionally walked to load the bases and Torrens lined an 0-2 pitch into right field to set off a wild, exhausted celebration.\n\n“It’s a big moment for me and for the team, too,” Torrens said.\n\nThe lack of runs left Castillo and Cole out of the decision on a night when both deserved a victory.\n\nCole scattered four hits and struck out eight in seven innings — a drastic turnaround after he was rocked for six runs in the first inning less than a week ago when he last faced the Mariners.\n\nCastillo allowed three hits and struck out seven in eight innings.\n\n“That had the look of two aces going at it,” Yankees manager Aaron Boone said. “I actually thought against the starters both teams took a bunch of tough at-bats.\"\n\nBrash (3-3) threw two innings to get the win. Seattle’s bullpen combined for five hitless innings with seven strikeouts.\n\nMistakes on the bases cost the Yankees multiple chances in extra innings. Andrew Benintendi was picked off trying to advance to third with no outs in the 10th. Aaron Hicks lined into a double play leading off the 11th as Miguel Andújar drifted too far from second.\n\nIn the 12th, Brash made a spectacular, blind, behind-the-back grab of Isiah Kiner-Falefa’s grounder and caught Jose Trevino in a rundown between second and third. Kiner-Falefa was thrown out trying to advance to second on the play.\n\n“I don’t want to lose our aggression on the bases. We’ve been really successful stealing at a good clip,” Boone said. “But we've got to be a little smarter and we’ve had a couple here in the last couple of weeks that have kind of hurt us.”\n\nSeattle missed chances to end it in the 11th and 12th before finally converting thanks to Torrens.\n\nCastillo bested Cole by finishing off the eighth and pitching out of trouble in the process. The right-hander got a groundout from Kiner-Falefa with a runner at third to end the inning.\n\nCastillo was the first Seattle pitcher to throw eight innings this season. It was his third start against the Yankees in the past month. In the three outings combined, Castillo has thrown 21 2/3 innings, allowed four earned runs and struck out 23.\n\n“I just kept thinking to myself, ‘What inning are we going to win? What inning are we going to win?’ Thank God we got the victory,” Castillo said through a translator.\n\nROSTER MOVES\n\nNew York placed Matt Carpenter on the 10-day injured list after he broke his left foot in Monday’s game. Andújar was recalled from Triple-A Scranton/Wilkes-Barre.\n\nSeattle recalled LHP Brendan Bernardino and placed LHP Ryan Borucki on the 15-day injured list. Borucki left in the ninth inning Monday night with a strained left forearm. He underwent an MRI on Tuesday.\n\nTRAINER’S ROOM\n\nYankees: 1B Anthony Rizzo was out of the starting lineup for a fifth straight game due to issues with his lower back. Boone said the team is being extra cautious and the hope remains Rizzo could be back in the lineup for Wednesday’s series finale. Rizzo missed time in July due to the same back problems. “I think it just improved quicker last time. I don’t think the injury itself has been as bad,” Boone said. ... Carpenter is expected to see a foot specialist in Seattle on Wednesday before traveling with the team back to the East Coast.\n\nMariners: CF Julio Rodríguez won’t be activated from the injured list for Wednesday’s series finale. Servais said Rodríguez was still feeling discomfort in his wrist after hitting on Monday. Servais said the goal is for Rodríguez to be ready for Friday’s series opener in Texas. ... INF/OF Dylan Moore (back) and RHP Diego Castillo (shoulder) are both expected to be activated from the IL on Wednesday.\n\nUP NEXT\n\nYankees: LHP Nester Cortes (9-3, 2.57 ERA) allowed two runs but just one hit in his last start against St. Louis. Cortes has three starts this season with at least five innings pitched and only one hit allowed.\n\nMariners: LHP Robbie Ray (8-8, 3.96) faces the Yankees for the first time since leaving the AL East. Ray is 1/3 with a 4.50 ERA in five previous starts against New York. He allowed one run over seven innings in his last outing.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "18",
		"title": "Judge hits No. 44, Yankees beat Mariners 9-4 to stop skid",
		"date": "08/08/2022 11:00 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — On a night when the Yankees ended their losing streak and Aaron Judge homered yet again, it wasn't all good news for New York.\n\nJudge hit his 44th homer, Josh Donaldson went deep and drove in three runs, and the Yankees snapped a five-game skid by beating the Seattle Mariners 9-4 on Monday.\n\nDonaldson doubled twice and Andrew Benintendi also had two doubles and three RBI as the Yankees hammered Seattle pitching. But they got a bad break early — Matt Carpenter fractured his left foot when he fouled off a pitch in the first inning.\n\n“I have no doubt in my mind that he’s going to still make an impact on this team even while he’s hurt,” said Yankees starter Jameson Taillon, who threw seven innings to get the win. “He’s come in here right away and made an impact on a lot of people. He’s not afraid to talk pitching with the pitchers. He’s not afraid to give honest feedback. He’s one of the best guys that I've been around and played with, so I wouldn’t be surprised if he finds his way back and makes an impact.”\n\nCarpenter, who was in a walking boot after the game, said there's no timeframe yet for a possible return and he would first need to see a foot specialist. Carpenter began the night hitting .307 with 15 home runs and 37 RBI in just 127 at-bats.\n\n“My mindset is that this won’t be the end for me here this year. I’m hopeful that I can come back and contribute,” he said.\n\nEven without Carpenter, the Yankees had plenty of punch to stop their longest losing streak of the season.\n\nDonaldson and Benintendi got it started as New York knocked around Logan Gilbert for seven earned runs and 10 hits — six for extra bases. That was plenty for Taillon (11-2), who scattered three hits over seven innings.\n\nNew York manager Aaron Boone held a team meeting ahead of the series opener in Seattle after the Yankees were swept in St. Louis last weekend. His message was mostly a reminder the Bronx Bombers are arguably the most talented team in the American League and following the trade deadline have the pieces to make this a special season.\n\nMessage received.\n\n“It was a nice little get-together pregame. We went out there with a ton of energy,” Taillon said.\n\nDonaldson had a two-run single in his first at-bat, launched his 11th home run with two outs in the third and hit the first of three consecutive doubles in the fifth that ended Gilbert’s night.\n\n“The last two weeks I’ve felt like my at-bats have certainly been more consistent,” Donaldson said.\n\nBenintendi’s two-out double in the third inning scored Gleyber Torres, and his double over the head of left fielder Jesse Winker in the fifth scored two and was the final batter for Gilbert.\n\nSeattle’s young right-hander gave up a season high in runs and hits. It was the first time in 23 starts this season that Gilbert (10-5) failed to pitch at least five innings.\n\n“I guess it was a matter of execution. They hit some good pitches that I made, and, of course, when you leave it over the middle or get behind in the count, good hitters are going to hit it,” Gilbert said.\n\nTaillon gave up solo home runs to Mitch Haniger in the first and Cal Raleigh in the seventh, but otherwise avoided major damage. J.P. Crawford worked an 11-pitch, bases-loaded walk in the fourth to plate a run, and Raleigh followed with a long fly ball that had home run distance but was pulled slightly foul.\n\nOtherwise, Taillon cruised. He walked three and struck out six in winning his first start since beating Boston on July 16.\n\nJudge connected in the ninth.\n\nTRAINER’S ROOM\n\nYankees: 1B Anthony Rizzo was out of the lineup for the fourth straight game due to an ongoing back issue. Boone said the hope is Rizzo will have improved enough to return to the lineup Tuesday. Rizzo missed time in July with the same lower-back issue.\n\nMariners: Winker left in the fifth due to back spasms. He was replaced by Jake Lamb. Seattle manager Scott Servais said Winker is day-to-day. ... LHP Ryan Borucki exited in the ninth in the middle of an at-bat with a forearm strain after throwing a pitch to Benintendi. ... Servais said CF Julio Rodriguez was going to take additional swings before Monday’s game to get a gauge on where he’s at with his wrist injury. Rodriguez could get activated Wednesday or Seattle could use Thursday’s off day and bring him back Friday. ... INF/OF Dylan Moore (back spasms) is expected to come off the injured list Wednesday. ... LHP Matthew Boyd (elbow) threw live batting practice as he continues his recovery from elbow surgery last September. Boyd’s next step is expected to be a rehab assignment.\n\nUP NEXT\n\nYankees: RHP Gerrit Cole (9-4, 3.56 ERA) looks to rebound from his last start in which he allowed six runs in the first inning against Seattle. Cole is 6-3 with a 2.48 ERA in 10 career starts against the Mariners.\n\nMariners: RHP Luis Castillo (5-4, 2.95) makes his first start at home since being acquired from Cincinnati. Castillo allowed three runs and struck out eight over 6 2/3 innings last week at Yankee Stadium in his first start for Seattle.\n\n------\n\nAs they try to hang on to their slim lead in the AL Central, the Guardians lost Zach Plesac (broken hand) and Aaron Civale (forearm inflammation) to the 15-day injured list.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n"
	},
	{
		"id": "19",
		"title": "Winker hits slam, Mariners drop Angels 6-3; Ohtani shaken up",
		"date": "08/07/2022 04:24 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Jesse Winker hit a grand slam, Marco Gonzales struck out seven and the Seattle Mariners beat the Los Angeles Angels 6-3 on Sunday as Shohei Ohtani received a visit from trainers and continued to struggle.\n\nWinker’s slam – the second of the season for Seattle and Winker’s third career one – put Seattle up 5-1 and helped the Mariners stay in third in the AL wild-card race. Eugenio Suárez added two hits and drove in a run.\n\n“You know, the one thing about Wink is he’s a talker,” Mariners manager Scott Servais said. “He likes to get everybody going and you need the days like today. I talked to him about it a little before the game today: ‘I need your energy today. Go ahead, talk smack, get your teammates fired up,’ and as soon as you give him the key, he takes it and runs with it.”\n\nTwo-way sensation Ohtani was visited by trainers before his second at-bat after colliding with Gonzales near the on-deck circle in a collision with Gonzales, but stayed in the game and interim Angels manager Phil Nevin confirmed “he's OK.”\n\nGonzales (7-11) also took a comebacker off the foot as he snapped a two-game losing streak. David Fletcher doubled for two runs in the three-hit fourth inning and added another RBI in the sixth to cut Seattle’s lead to 6-3. But Gonzales reached a season-high 91 mph a couple of times after the incidents, giving up a walk and eight hits, to lead Seattle to its second win in three games\n\n“Guys were joking that I need to get beat up before the game apparently,” Gonzales joked. “But I’d vote against that.”\n\nAndrés Muñoz, Penn Murfee and Paul Sewald combined for three scoreless innings of relief as Seattle improved to an AL-best 22-9 in its last 31 games. Sewald earned his 14th save in 17 attempts.\n\nLos Angeles starter Tucker Davidson (1-3), in his first appearance since being acquired from the Atlanta Braves on Tuesday, walked five and struck out one in an uneven start over four innings. He gave up six earned runs and six hits.\n\n“He showed us some flashes of some stuff that we heard about,” Nevin said. “... I can understand being nervous coming to your ... first time pitching for a new team, and I think that'll calm down his next time out.”\n\nTy France and Mitch Haniger hit consecutive one-out singles in the third inning before Davidson walked Suárez, loading the bases for Winker. The left fielder bent a 2-0 pitch around the right-field foul pole for a 5-1 lead. Sam Haggerty added a run-scoring double in the fifth.\n\nAll those hits were clutch, something the Mariners have struggled with all season.\n\n“I try to remind myself that you know the pressure is on\" the pitcher, Winker said. “It’s just my job to put a good swing on the ball and obviously those are three clutch at-bats in a time of the game where we needed them. ... That was the story of the game for sure.\"\n\nOHTANI INJURED?\n\nOhtani and Gonzales collided as the pitcher attempted to back up home plate in the third inning on a throw from the outfield. Ohtani drifted toward the field of play while watching events unfold as Gonzales backpedaled into position.\n\n\"I felt bad,” Gonzales said. “I crushed his foot and luckily didn’t roll my ankle too bad and was able to keep going.”\n\nGonzales also got a visit from the trainer and stayed in the game. Ohtani struck out in that at-bat, but appeared to have a bit of a limp after reaching base on a single in the fifth inning.\n\nOhtani struggled in the four-game series against the Mariners, going 2-for-16 with seven strikeouts.\n\n“Just a little spike on the top of the foot,” Nevin said. “He's OK.”\n\nROSTER MOVE\n\nThe Angels claimed OF Steven Duggar on waivers from Texas and designated OF Dillon Thomas for assignment.\n\nTRAINER’S ROOM\n\nAngels: OF Mickey Moniak, a top rookie prospect acquired from the Philadelphia Phillies this week in part of the deal for pitcher Noah Syndergaard, will miss at least eight days after fracturing the tip of his left middle finger in the ninth inning of Saturday’s 7-1 night-cap win over Seattle. Moniak and the team said he also received six stitches after a ninth-inning bunt attempt that went wrong. He’ll be re-evaluated when the stitches are removed in eight to 10 days and could be back in the lineup at that point.\n\nMariners: CF Julio Rodriguez (right wrist contusion) took batting practice before Sunday’s game with a lighter bat. Servais said he was still a little bit sore but progressing. He’s been out since July 31 and is eligible to return Aug. 10. … Servais said RHP Diego Castillo (right shoulder inflammation) is preparing to make a rehab appearance at Double-A Everett. He also could return as soon as Aug. 10.\n\nUP NEXT\n\nAngels: LHP Jose Suarez (3-4, 4.55 ERA) takes the mound Monday when L.A. travels to Oakland. He will be going for his second straight win against the Athletics and has not allowed an earned run in his last 11 innings.\n\nMariners: RHP Logan Gilbert (10-4, 3.09) takes the mound in the series opener against the New York Yankees on Monday. Gilbert gave up 6 earned runs and seven hits in 5 1/3 innings in his last start, Aug. 2 against the Yankees in New York.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "20",
		"title": "Detmers, Fletcher help Angels split DH with M's; Moniak hurt",
		"date": "08/06/2022 10:42 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Reid Detmers pitched seven smooth innings, Mickey Moniak hit his second home run in three days before getting injured, and the Los Angeles Angels defeated the Seattle Mariners 7-1 on Saturday night to split their doubleheader.\n\nDavid Fletcher homered and drove in three runs for the Angels, who dropped the opener 2-1 as Ty France hit a two-run homer and George Kirby struck out eight over six innings for Seattle.\n\nIn the nightcap, Taylor Ward got the scoring started in the third with an RBI double that drove in speedy Magneuris Sierra from first base. Ward came home later in the inning on Max Stassi's single.\n\nMoniak launched a solo shot in the fourth, making it 3-0 with his third major league homer.\n\nThe top pick in the 2016 amateur draft, Moniak was acquired from Philadelphia at Tuesday's trade deadline in a deal for pitcher Noah Syndergaard. The 24-year-old outfielder also went deep Thursday against Oakland, but began the day a .131 career hitter in 99 at-bats over 50 big league games.\n\nMoniak exited after taking a pitch off his finger in the ninth inning on a bunt attempt. He went for X-rays, and Angels interim manager Phil Nevin was not expecting good news.\n\n“It’s not looking good,” Nevin said. “I’m crushed for him, but it’s a part of the game.”\n\nLuis Torrens put the Mariners on the board in the fifth with a home run to right-center against Detmers, his first of the season.\n\nDetmers (4-3) was dominant early, allowing just one hit through four innings. After the hiccup in the fifth, the rookie left-hander settled back in. He permitted six hits overall and struck out seven.\n\n“He was awesome. You’re seeing a really good one just growing before our eyes,” Nevin said. “Pitching deep into a game like that, being able to get out of a jam there in the seventh, and reaching back out against the guy who hit the ball hard against him a couple times. It was a big outing for him.”\n\nFletcher extended the Angels' lead to 5-1 with a two-run homer off starter Chris Flexen in the sixth.\n\n\"It’s always huge when we have run support,” Detmers said. “The last couple outings, I’ve had run support. We got on the board early and credit to them, they just kept going.”\n\nFlexen (7-9) pitched six innings, allowing five earned runs on six hits and two walks with five strikeouts.\n\nMariners reliever Matt Brash tossed a scoreless seventh, but lefty Brennan Bernardino allowed two runs in the ninth — one on an RBI single from Fletcher, the other on a bases-loaded sacrifice fly by Shohei Ohtani.\n\nIn the first game, Moniak gave the Angels a one-run lead with an RBI single in the second, but France’s third-inning homer into the left-field bullpen put the Mariners ahead for good. The go-ahead drive was France’s 14th homer of the season and his 300th hit with the Mariners.\n\n“That I was able to pull a hanging slider just shows that I was on time for a fastball,” France said. “That is the biggest key. If I can get on time for a fastball, I’m going to be in a good spot, and I feel like I’m getting there again.”\n\nKirby (3-3) got the win, while Jaime Barria (1-2) was tagged with the loss in his first start this season. Erik Swanson pitched the ninth for his third save.\n\nIt was Kirby’s second victory since being recalled from Triple-A Tacoma on July 23. The Mariners optioned him down on July 9 to limit the rookie’s workload.\n\n“He’s looked great,” Seattle manager Scott Servais said. “After we shut him down and gave him a little breather, he has come back and has thrown very well. The velo is still there, the secondary stuff is there, and he has looked strong. That is exactly what we need out of him going forward.”\n\nTRAINER'S ROOM\n\nMariners: OF Mitch Haniger (ankle) was activated from the 60-day injured list prior to the second game and penciled into the No. 3 spot in the lineup. Haniger had been out since sustaining a high right ankle sprain against Miami on April 29. In a corresponding move, INF Abraham Toro was optioned to Tacoma.\n\nUP NEXT\n\nAngels: LHP Tucker Davidson (1-2, 6.46 ERA) starts Sunday after being obtained from Atlanta at Tuesday's trade deadline. Davidson has allowed 11 earned runs, 15 hits and 13 walks in 15 1/3 innings this season with 10 strikeouts.\n\nMariners: LHP Marco Gonzales (6-11, 3.95) gave up six earned runs and nine hits at Yankee Stadium on Monday.\n\n------\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Saturday, September 3.\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\n"
	},
	{
		"id": "21",
		"title": "France hits 2-run HR, Kirby sharp as Mariners top Angels 2-1",
		"date": "08/06/2022 04:17 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Ty France hit a two-run homer into the left-field bullpen in the third inning, George Kirby pitched six solid innings and the Seattle Mariners beat the Los Angeles Angels 2-1 Saturday to open a doubleheader.\n\nFrance’s homer came with two outs against starter Jaime Barria (1-2) and erased a one-run lead that came from Mickey Moniak’s second-inning RBI single.\n\nThe go-ahead blast, which was France’s 300th hit with the Mariners, came one day after he had a tying single in the ninth during a 4-3, 10-inning loss to the Angels.\n\nFrance has 14 homers on the season.\n\n“That I was able to pull a hanging slider just shows that I was on time for a fastball,” France said. “That is the biggest key. If I can get on-time for a fastball, I’m going to be in a good spot, and I feel like I’m getting there again.”\n\nBarria, making his first start of the season, went 4 2/3 innings while allowing three hits, two earned runs and four walks with three strikeouts.\n\nHe was pulled after 76 pitches in favor of right-hander Mike Mayers after loading the bases with back to back walks in the fifth. Mayers retired Eugenio Suarez on a pop-out to end the threat.\n\n“I love what I saw,” Angels interim manager Phil Nevin said. “Mike was able to come in and get him out of the fifth, but for him to go that far and for those two guys to get the load on this game, it really helps us for Game 2.”\n\nKirby (3-3) pitched well after a bumpy second inning, allowing six hits, one earned run and no walks with eight strikeouts. Saturday’s outing was the third time this season Kirby has pitched at least six innings and allowed no walks.\n\nThe six-inning outing was Kirby’s second win since being recalled from Triple-A Tacoma on July 23. The Mariners optioned Kirby to Tacoma on July 9 to limit the rookie’s workload.\n\n“He’s looked great,” Seattle manager Scott Servais said. “After we shut him down and gave him a little breather, he has come back and has thrown very well. The velo is still there, the secondary stuff is there, and he has looked strong. That is exactly what we need out of him going forward.”\n\nAndres Munoz struck out three in relief, and Erik Swanson pitched the ninth for his third save.\n\nROSTER MOVES\n\nMariners LHP Brennan Bernardino was added to the roster as the Mariners’ 27th man. Bernardino made his major league debut for the Mariners on July 31 at Houston after being signed earlier this year out of the Mexican League.\n\nRHP Oliver Ortega was the 27th man for the Angels.\n\nTRAINER’S ROOM\n\nMariners: OF Mitch Haniger (ankle) was back in the clubhouse before the first game on Saturday and could be activated in time for Game 2. Haniger has been out since April 30 with a high right ankle sprain.\n\nAngels: INF David Fletcher (foot) will play in Saturday’s nightcap after sitting out the past two games with a foot injury.\n\nUP NEXT\n\nMariners: RHP Chris Flexen (7-8, 3.73) will pitch the second game for Seattle. Flexen allowed three hits and two earned runs against the Astros in his last start on July 30.\n\nAngels: LHP Reid Detmers (3-3, 3.63) is on the mound for the Angels in the nightcap. Detmers allowed just three hits and one earned run over seven innings on July 31 against Texas.\n\n------\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\nSeattle Mariners (73-58, second in the AL West) vs. Cleveland Guardians (68-61, first in the AL Central)\n\n"
	},
	{
		"id": "22",
		"title": "Angels blow late lead, rally in 10th for 4-3 win over M's",
		"date": "08/05/2022 10:52 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — A night after hitting seven home runs and losing, the Los Angeles Angels needed just one long ball to hold off one of the hottest teams in baseball.\n\nTaylor Ward's sacrifice fly scored Magneuris Sierra in the 10th inning, and the Angels blew a three-run lead late before pulling out a 4-3 win over the Seattle Mariners on Friday night.\n\nThe Angels led 3-0 going to the bottom of the ninth before Seattle scored three times with two outs to force extra innings.\n\n“It was a well played game in all facets,” Angels interim manager Phil Nevin said. “We swung the bats well, didn't punch a bunch across, but got the important ones when needed.”\n\nWard's fly ball off Paul Sewald (3-3) was deep enough for Sierra to score easily and give the Angels the lead. Jimmy Herget pitched a perfect bottom of the 10th to get the save.\n\nMax Stassi hit a two-run homer in the top of the ninth inning to give the Angels a 3-0 lead that proved critical when Seattle rallied for three runs in the bottom of the inning.\n\n“Really impressed with those big hits late in the game like that when you haven't done much offensively. These guys stepped up,” Seattle manager Scott Servais said.\n\nSeattle's three-run rally in the ninth started when Jesse Winker walked with one-out against Jesse Chavez (2-1). Pinch-hitter Jake Lamb singled, and with two outs, Adam Frazier doubled to score Winker.\n\nTy France dribbled a single into center field to score Lamb and Frazier and pulled the Mariners even at 3-3. Seattle had three hits through the first eight innings, then strung together three in the ninth.\n\n“He's a veteran guy. He's done this before. He's going to pitch some big innings late. He got a groundball there, it just got through,” Nevin said of using Chavez in the ninth.\n\nIt was the first matchup between the teams since their wild brawl on June 26 that resulted in multiple suspensions and a couple of injuries. Both Servais and Nevin said pregame the incident was in the past.\n\nThe Mariners' rally ruined the night for Angels starter Patrick Sandoval, who was in line for his first victory since May 22. Sandoval threw 5 1/3 shutout innings relying heavily on offspeed pitches, and Aaron Loup and Jose Quijada kept the shutout going into the ninth.\n\n“I wanted to go in with my best pitches and play the odds with the best stuff I got,” Sandoval said. “So, slider, changeup, is primarily my best two pitches so I'm going to throw them as much as I can.”\n\nPitching was the story of the night until the ninth inning for both sides. Sandoval stymied the Mariners into the sixth, while Seattle starter Robbie Ray was terrific for seven innings with 10 strikeouts.\n\nThe only damage against Ray came in the first inning when Luis Rengifo doubled and Jo Adell followed with a broken-bat single to give the Angels the early lead.\n\nRay was otherwise dominant after getting roughed up in his previous two starts, both against Houston. Ray scattered five hits and had his sixth start this season with at least 10 strikeouts.\n\n“I think for me, more than just getting back on track, I feel like I've kind of found something with my delivery over the last week, just really getting into my lower half, and really feeling my drive down the mound,” Ray said.\n\nROSTER MOVES\n\nFormer Angels IF David MacKinnon was claimed off waivers today by Oakland. MacKinnon had been designated for assignment on Tuesday.\n\nSeattle added Lamb to the roster and designated for assignment OF Travis Jankowski. Lamb was acquired from the Los Angeles Dodgers ahead of the trade deadline and now gets the chance to play for his hometown team.\n\n“I feel like I’ve gotten chills the past two days over and over and over,” Lamb said.\n\nTRAINER’S ROOM\n\nAngels: IF David Fletcher was out of the lineup after getting hit in the foot by a pitch in Thursday’s game against Oakland. He’s expected back in the lineup on Saturday.\n\nMariners: OF Julio Rodriguez (wrist) is expected to pick up his baseball activity this weekend and should not need to go out on a rehab assignment when his stint on the injured list ends. ... IF/OF Dylan Moore (back spasms) is quickly improving and could be ready when his time on the IL ends. ... RHP Diego Castillo (shoulder) threw a bullpen on Friday. ... LHP Matthew Boyd (elbow), acquired at the trade deadline, will likely throw a live batting practice early next week before going out on a rehab assignment.\n\nUP NEXT\n\nAngels: The Angels will start RHP Jaime Barria (1-1, 2.55) in the first game of the doubleheader.\n\nMariners: RHP George Kirby (2-3, 3.56) makes his 15th start of the season. Kirby has been under pitch limits in his last two starts coming out of the All-Star break. Kirby allowed two runs struck out seven in four innings in his last start against Houston.\n\n------\n\nSet your lineups for the week ahead in fantasy baseball with our forecaster preview, which features pitcher rankings, two-start pitchers, hitter ratings, schedule observations and more.\n\nEverything you need to know to place your MLB bets and set your fantasy baseball lineups for Friday, September 2.\n\nStay ahead of the game and optimize your fantasy baseball hitters with our forecaster, which provides a rolling 10-day outlook of every team's hitting matchups as well as the potential for stolen bases.\n\nKeep up to date on who is pitching -- and how well they're expected to do -- with our forecaster, which provides a rolling 10-day outlook of every team's probable starting pitchers with game score projections.\n\n3,000 hits? A ring? Retiring as a Padre? A decade into his career, Machado still has his future ahead of him.\n\nSeattle Mariners (73-58, second in the AL West) vs. Cleveland Guardians (68-61, first in the AL Central)\n\n"
	}
]