[
	{
		"id": 1,
		"title": "Julio Rodriguez returns to lineup, Mariners beat Rangers",
		"date": "08/12/2022 09:07 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "Eugenio Suarez sends one to the gap, which ends up scoring two Mariners in the ninth inning. (0:42)\n\nARLINGTON, Texas -- — Star rookie Julio Rodriguez got two hits in his return to the Seattle lineup and the Mariners took over the first wild-card position in the American League by beating the Texas Rangers 6-2 on Friday night.\n\nThe 21-year-old Rodriguez, who put on an impressive show in the All-Star Home Run Derby, had missed the Mariners’ previous 11 games with a wrist injury.\n\nRodriguez hit a tiebreaking, opposite-field single to shallow right with the bases loaded in the fourth inning. He was the first batter to face Jose Leclerc, who relieved Taylor Hearn (5-7).\n\nRodriguez hit a grand slam off Leclerc at Globe Life Field on July 15.\n\n“I just felt good,” Rodriguez said. “I just went out there and competed. I wasn’t worried about anything.”\n\nRodriguez also sent 400-foot shot nearly over the left-field foul pole in the sixth that was ruled foul, even after a Seattle challenge.\n\n“I thought it went over,” Rodriguez said. “They should put (the pole) higher.”\n\nGeorge Kirby (4-3) allowed two runs in 5 2/3 innings on seven hits with five strikeouts and one walk. It was the rookie’s second straight win.\n\nThe victory, combined with Toronto’s loss to Cleveland, gave the Mariners a half-game lead over the Blue Jays.\n\nThe Mariners are a season-best 10 games over .500 and are 12-2 with nine consecutive wins this season against the Rangers, who dropped to a season-low 14 games under .500.\n\nSeattle took a 4-2 lead into the ninth inning and Eugenio Suarez added a two-run double.\n\nThe Rangers scored on Marcus Semien’s groundout in the third and Jonah Heim’s single in the sixth.\n\nTexas used a bullpen game with Josh Sborz making his first start in 88 big league appearances.\n\nSborz took a liner off his upper right arm during the game’s third batter, Mitch Haniger. Sborz finished the inning with one more pitch and was replaced in the second by Hearn, the first of five Texas relievers.\n\nRangers manager Chris Woodward said Sborz was obviously sore but the pitcher’s status won’t be clear until being examined Saturday.\n\nThe Rangers’ first hit was Nathaniel Lowe’s infield single leading off the second, but he was doubled off first to end the inning following a running, leaping catch by Haniger at the wall in right field on a ball hit by Leody Taveras.\n\n500TH CAREER WIN FOR SERVAIS\n\nSeattle manager Scott Servais’ voice cracked as he talked about the milestone victory.\n\n“It’s really hard to do – and not get fired,” he said with a laugh. “It’s a credit to our players. I said that to them when they dumped the Gatorade or whatever on me.”\n\nEARLY EXIT\n\nWoodward was ejected by Jerry Meals, the plate umpire and crew chief, in the bottom of the fourth inning during Adolis Garcia’s leadoff at-bat. It was Woodward’s first ejection this season.\n\nSHORT HOPS\n\nSeattle was 3 for 12 with runners in scoring position, Texas 1 for 6. … Lowe has an 18-game on-base streak, the longest by a Ranger this season. … Haniger had three singles and is 10 for 22 in six games since returning from an ankle sprain that sidelined him since late April. … The Mariners designated RHP Ken Giles for assignment.\n\nTRAINER’S ROOM\n\nMariners: C Curt Casali (oblique) returned from the 10-day injured list Thursday. Casali was acquired from San Francisco on Aug. 2 and hasn’t appeared for Seattle.\n\nRangers: OF Kole Calhoun (right heel irritation) is feeling better, but Woodward isn’t sure when he can return.\n\nUP NEXT\n\nMariners: LHP Marco Gonzales (7-11, 3.98 ERA) will make his fifth start vs. Texas this season on Saturday. He’s 1-1 with a 4.38 ERA in those games, which the M’s and Rangers split.\n\nRangers: RHP Dane Dunning (2-6, 4.04) won last Saturday for the first time since April 30, shutting out the Chicago White Sox over seven innings on one hit and one walk.\n\n------\n\nMatt Olson launches a beauty to left field to give the Braves a 4-2 lead in the top of the fifth inning.\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\n"
	},
	{
		"id": 2,
		"title": "Santana's homer rallies Mariners for 4-3 win over Yankees",
		"date": "08/10/2022 04:19 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — In a clubhouse with little experience of being in a playoff chase, Carlos Santana is the old guy that can be turned to for advice and guidance.\n\nAnd sometimes he comes up with a clutch hit or two as a reminder he's still pretty good player.\n\nSantana snapped an 0-for-17 slump with a go-ahead two-run homer during Seattle's three-run seventh inning, and the Mariners rallied to beat the slumping New York Yankees 4-3 on Wednesday.\n\n“I trust Carlos in a number of different areas, certainly on the field, the pedigree and the experience level,” Seattle manager Scott Servais said. “I also trust him a lot in the clubhouse.”\n\nThanks to two tense, one-run victories, Seattle took two of three from New York for the second straight week to win the season series 4-2. The Mariners won 1-0 in 13 innings on Tuesday night. With the Yankees leading the AL East and Seattle in the first AL wild-card spot, the teams could meet again in the playoffs.\n\nAaron Judge hit his major league-leading 45th homer of the season for the Yankees, who have lost eight of 10.\n\n“I think they're really good. They can pitch, obviously have some good starters, but their bullpen is about as good a bullpen as we faced,” New York manager Aaron Boone said of Seattle. “They can mix and make, they got right and left in their lineup. Obviously they're going to get (Julio) Rodriguez back. That team certainly feels for real.”\n\nSeattle has not lost a series to a team other than AL West-leading Houston since mid-June, when it dropped four of five to the Los Angeles Angels. Seattle is 10-10 since the All-Star break, a challenging stretch that including 13 games against Houston and New York.\n\nSeattle improved to 27-14 in one-run games.\n\n“I think we just play so many of them that we’re more comfortable in them than other teams,” said Seattle reliever Paul Sewald, who pitched the ninth for his 15th save. “Those guys blow people out all the time. Playoffs are going to be tight and we’re really good at one run games. We’re just comfortable playing in them.”\n\nKyle Higashioka hit a go-ahead, two-run homer on the 115th and final pitch from Seattle starter Robbie Ray in the seventh to snap a 19-inning scoreless streak for the Yankees, and Judge's longball against Penn Murfee (3-0) made it 3-1 later in the frame.\n\nMurfee then retired DJ LeMahieu and Anthony Rizzo, Diego Castillo pitched a perfect eighth, and Sewald worked the ninth.\n\nRay and New York starter Nestor Cortes were both terrific, following standout performances Tuesday night from the Yankees' Gerrit Cole and the Mariners' Luis Castillo.\n\nCortes struck out 10 and didn't allow a hit until Sam Haggerty homered off the left-field foul pole with one out in the sixth.\n\n“It was a fastball away I yanked into the bottom of the zone where he crushes the ball,” Cortes said. “Just a mistake pitch.”\n\nCortes was lifted after giving up consecutive singles to Ty France and Mitch Haniger to open the seventh. Haniger's hit scored France to make it 3-2.\n\n“He just couldn't put those last two guys away,” Boone said.\n\nAlbert Abreu (2-2) struck out Eugenio Suarez but left a changeup in the middle of the plate and Santana didn’t miss, hitting his seventh home run since being acquired by Seattle in June.\n\n“It’s a long season, up and down, but my head never gets down. I’m strong mentally. My mentality now is try to help my teammates finish strong.”\n\nThe 36-year-old Santana reached the playoffs in four seasons with Cleveland.\n\nRay allowed three hits and two runs in 6 1/3 innings. He struck out seven but walked a season-high five.\n\n“I overheard it on the broadcast last night — that’s like a couple playoff teams going at it in a playoff series,” Ray said. That’s what it felt like. ... It seemed like it was punch for punch, every single pitch, every single inning.\"\n\nROSTER SHUFFLE\n\nSeattle optioned OF/DH Kyle Lewis and LHP Brandon Bernardino to Triple-A Tacoma to clear roster spots for the return of Diego Castillo and utilityman Dylan Moore.\n\nLewis, the 2020 AL rookie of the year, struggled badly at the plate after returning from a concussion. Lewis was hitting .098 with 18 strikeouts in his previous 46 plate appearances.\n\n“Kyle’s tool is the bat and it has been a struggle since he came back up here. Recently, the strikeout has crept in. I do think there’s a role for him on our club. But you need to be productive,” Servais said.\n\nSeattle is also moving RHP Chris Flexen to the bullpen. The Mariners picked up a sixth starter when they acquired Luis Castillo at the trade deadline. Servais said Flexen may come back into the rotation later in the season as Seattle monitors the innings of rookie George Kirby.\n\nTRAINER’S ROOM\n\nYankees: IF Matt Carpenter is expected to miss at least six weeks due to his fractured left foot suffered in Monday's series opener. Carpenter saw a specialist in Seattle on Wednesday morning. ... Rizzo returned to the lineup after missing the previous five games with lower back issues.\n\nMariners: Seattle remains hopeful CF Julio Rodriguez (wrist) will be activated off the injured list before Friday’s series opener in Texas. ... SS J.P. Crawford was given the day off.\n\nUP NEXT\n\nYankees: RHP Domingo German (1-2, 5.09 ERA) will start the opener of a three-game series at Boston on Friday.\n\nMariners: Seattle has not announced its rotation for the series at Texas that begins Friday.\n\n------\n\nMatt Olson launches a beauty to left field to give the Braves a 4-2 lead in the top of the fifth inning.\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\n"
	},
	{
		"id": 3,
		"title": "Lucky 13: Mariners top Yankees in extras for tense 1-0 win",
		"date": "08/09/2022 11:44 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — After four hours of dominant pitching, some bad baserunning and slick defense, Luis Torrens and the Seattle Mariners finally broke through.\n\nTorrens singled with one out in the 13th inning to score Eugenio Suárez, and the Mariners beat the New York Yankees 1-0 on Tuesday night in a game dominated by the starting pitching of Gerrit Cole and Luis Castillo.\n\n“That’s one of the best major league games I’ve ever watched. The pitching in this game was unbelievable on both sides,” Seattle manager Scott Servais said.\n\nThe two aces were overpowering into the late innings before turning it over to bullpens that managed to keep the game scoreless deep into the night.\n\nSome poor baserunning by the Yankees helped, as did a lack of execution by the Mariners as both teams had chances early in the extra frames.\n\nIt was the first major league game to reach the 13th inning scoreless since Tampa Bay against Detroit on Aug. 17, 2019 — before new rules were implemented in 2020 putting an automatic runner at second base to start each extra inning.\n\nAnd it had a playoff feel, with fans standing for most of the final five innings.\n\n“That was the coolest game I’ve ever been a part of,” said Seattle reliever Matt Brash. “Obviously, I’m new in the big leagues, but I mean, that atmosphere is what we want.”\n\nEventually, the Mariners came through in the 13th. Cal Raleigh singled off Jonathan Loáisiga (1-3) and advanced Suárez from second to third. One out later, Sam Haggerty was intentionally walked to load the bases and Torrens lined an 0-2 pitch into right field to set off a wild, exhausted celebration.\n\n“It’s a big moment for me and for the team, too,” Torrens said.\n\nThe lack of runs left Castillo and Cole out of the decision on a night when both deserved a victory.\n\nCole scattered four hits and struck out eight in seven innings — a drastic turnaround after he was rocked for six runs in the first inning less than a week ago when he last faced the Mariners.\n\nCastillo allowed three hits and struck out seven in eight innings.\n\n“That had the look of two aces going at it,” Yankees manager Aaron Boone said. “I actually thought against the starters both teams took a bunch of tough at-bats.\"\n\nBrash (3-3) threw two innings to get the win. Seattle’s bullpen combined for five hitless innings with seven strikeouts.\n\nMistakes on the bases cost the Yankees multiple chances in extra innings. Andrew Benintendi was picked off trying to advance to third with no outs in the 10th. Aaron Hicks lined into a double play leading off the 11th as Miguel Andújar drifted too far from second.\n\nIn the 12th, Brash made a spectacular, blind, behind-the-back grab of Isiah Kiner-Falefa’s grounder and caught Jose Trevino in a rundown between second and third. Kiner-Falefa was thrown out trying to advance to second on the play.\n\n“I don’t want to lose our aggression on the bases. We’ve been really successful stealing at a good clip,” Boone said. “But we've got to be a little smarter and we’ve had a couple here in the last couple of weeks that have kind of hurt us.”\n\nSeattle missed chances to end it in the 11th and 12th before finally converting thanks to Torrens.\n\nCastillo bested Cole by finishing off the eighth and pitching out of trouble in the process. The right-hander got a groundout from Kiner-Falefa with a runner at third to end the inning.\n\nCastillo was the first Seattle pitcher to throw eight innings this season. It was his third start against the Yankees in the past month. In the three outings combined, Castillo has thrown 21 2/3 innings, allowed four earned runs and struck out 23.\n\n“I just kept thinking to myself, ‘What inning are we going to win? What inning are we going to win?’ Thank God we got the victory,” Castillo said through a translator.\n\nROSTER MOVES\n\nNew York placed Matt Carpenter on the 10-day injured list after he broke his left foot in Monday’s game. Andújar was recalled from Triple-A Scranton/Wilkes-Barre.\n\nSeattle recalled LHP Brendan Bernardino and placed LHP Ryan Borucki on the 15-day injured list. Borucki left in the ninth inning Monday night with a strained left forearm. He underwent an MRI on Tuesday.\n\nTRAINER’S ROOM\n\nYankees: 1B Anthony Rizzo was out of the starting lineup for a fifth straight game due to issues with his lower back. Boone said the team is being extra cautious and the hope remains Rizzo could be back in the lineup for Wednesday’s series finale. Rizzo missed time in July due to the same back problems. “I think it just improved quicker last time. I don’t think the injury itself has been as bad,” Boone said. ... Carpenter is expected to see a foot specialist in Seattle on Wednesday before traveling with the team back to the East Coast.\n\nMariners: CF Julio Rodríguez won’t be activated from the injured list for Wednesday’s series finale. Servais said Rodríguez was still feeling discomfort in his wrist after hitting on Monday. Servais said the goal is for Rodríguez to be ready for Friday’s series opener in Texas. ... INF/OF Dylan Moore (back) and RHP Diego Castillo (shoulder) are both expected to be activated from the IL on Wednesday.\n\nUP NEXT\n\nYankees: LHP Nester Cortes (9-3, 2.57 ERA) allowed two runs but just one hit in his last start against St. Louis. Cortes has three starts this season with at least five innings pitched and only one hit allowed.\n\nMariners: LHP Robbie Ray (8-8, 3.96) faces the Yankees for the first time since leaving the AL East. Ray is 1/3 with a 4.50 ERA in five previous starts against New York. He allowed one run over seven innings in his last outing.\n\n------\n\nMatt Olson launches a beauty to left field to give the Braves a 4-2 lead in the top of the fifth inning.\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\n"
	},
	{
		"id": 4,
		"title": "Judge hits No. 44, Yankees beat Mariners 9-4 to stop skid",
		"date": "08/08/2022 11:00 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — On a night when the Yankees ended their losing streak and Aaron Judge homered yet again, it wasn't all good news for New York.\n\nJudge hit his 44th homer, Josh Donaldson went deep and drove in three runs, and the Yankees snapped a five-game skid by beating the Seattle Mariners 9-4 on Monday.\n\nDonaldson doubled twice and Andrew Benintendi also had two doubles and three RBI as the Yankees hammered Seattle pitching. But they got a bad break early — Matt Carpenter fractured his left foot when he fouled off a pitch in the first inning.\n\n“I have no doubt in my mind that he’s going to still make an impact on this team even while he’s hurt,” said Yankees starter Jameson Taillon, who threw seven innings to get the win. “He’s come in here right away and made an impact on a lot of people. He’s not afraid to talk pitching with the pitchers. He’s not afraid to give honest feedback. He’s one of the best guys that I've been around and played with, so I wouldn’t be surprised if he finds his way back and makes an impact.”\n\nCarpenter, who was in a walking boot after the game, said there's no timeframe yet for a possible return and he would first need to see a foot specialist. Carpenter began the night hitting .307 with 15 home runs and 37 RBI in just 127 at-bats.\n\n“My mindset is that this won’t be the end for me here this year. I’m hopeful that I can come back and contribute,” he said.\n\nEven without Carpenter, the Yankees had plenty of punch to stop their longest losing streak of the season.\n\nDonaldson and Benintendi got it started as New York knocked around Logan Gilbert for seven earned runs and 10 hits — six for extra bases. That was plenty for Taillon (11-2), who scattered three hits over seven innings.\n\nNew York manager Aaron Boone held a team meeting ahead of the series opener in Seattle after the Yankees were swept in St. Louis last weekend. His message was mostly a reminder the Bronx Bombers are arguably the most talented team in the American League and following the trade deadline have the pieces to make this a special season.\n\nMessage received.\n\n“It was a nice little get-together pregame. We went out there with a ton of energy,” Taillon said.\n\nDonaldson had a two-run single in his first at-bat, launched his 11th home run with two outs in the third and hit the first of three consecutive doubles in the fifth that ended Gilbert’s night.\n\n“The last two weeks I’ve felt like my at-bats have certainly been more consistent,” Donaldson said.\n\nBenintendi’s two-out double in the third inning scored Gleyber Torres, and his double over the head of left fielder Jesse Winker in the fifth scored two and was the final batter for Gilbert.\n\nSeattle’s young right-hander gave up a season high in runs and hits. It was the first time in 23 starts this season that Gilbert (10-5) failed to pitch at least five innings.\n\n“I guess it was a matter of execution. They hit some good pitches that I made, and, of course, when you leave it over the middle or get behind in the count, good hitters are going to hit it,” Gilbert said.\n\nTaillon gave up solo home runs to Mitch Haniger in the first and Cal Raleigh in the seventh, but otherwise avoided major damage. J.P. Crawford worked an 11-pitch, bases-loaded walk in the fourth to plate a run, and Raleigh followed with a long fly ball that had home run distance but was pulled slightly foul.\n\nOtherwise, Taillon cruised. He walked three and struck out six in winning his first start since beating Boston on July 16.\n\nJudge connected in the ninth.\n\nTRAINER’S ROOM\n\nYankees: 1B Anthony Rizzo was out of the lineup for the fourth straight game due to an ongoing back issue. Boone said the hope is Rizzo will have improved enough to return to the lineup Tuesday. Rizzo missed time in July with the same lower-back issue.\n\nMariners: Winker left in the fifth due to back spasms. He was replaced by Jake Lamb. Seattle manager Scott Servais said Winker is day-to-day. ... LHP Ryan Borucki exited in the ninth in the middle of an at-bat with a forearm strain after throwing a pitch to Benintendi. ... Servais said CF Julio Rodriguez was going to take additional swings before Monday’s game to get a gauge on where he’s at with his wrist injury. Rodriguez could get activated Wednesday or Seattle could use Thursday’s off day and bring him back Friday. ... INF/OF Dylan Moore (back spasms) is expected to come off the injured list Wednesday. ... LHP Matthew Boyd (elbow) threw live batting practice as he continues his recovery from elbow surgery last September. Boyd’s next step is expected to be a rehab assignment.\n\nUP NEXT\n\nYankees: RHP Gerrit Cole (9-4, 3.56 ERA) looks to rebound from his last start in which he allowed six runs in the first inning against Seattle. Cole is 6-3 with a 2.48 ERA in 10 career starts against the Mariners.\n\nMariners: RHP Luis Castillo (5-4, 2.95) makes his first start at home since being acquired from Cincinnati. Castillo allowed three runs and struck out eight over 6 2/3 innings last week at Yankee Stadium in his first start for Seattle.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 5,
		"title": "Winker hits slam, Mariners drop Angels 6-3; Ohtani shaken up",
		"date": "08/07/2022 04:24 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Jesse Winker hit a grand slam, Marco Gonzales struck out seven and the Seattle Mariners beat the Los Angeles Angels 6-3 on Sunday as Shohei Ohtani received a visit from trainers and continued to struggle.\n\nWinker’s slam – the second of the season for Seattle and Winker’s third career one – put Seattle up 5-1 and helped the Mariners stay in third in the AL wild-card race. Eugenio Suárez added two hits and drove in a run.\n\n“You know, the one thing about Wink is he’s a talker,” Mariners manager Scott Servais said. “He likes to get everybody going and you need the days like today. I talked to him about it a little before the game today: ‘I need your energy today. Go ahead, talk smack, get your teammates fired up,’ and as soon as you give him the key, he takes it and runs with it.”\n\nTwo-way sensation Ohtani was visited by trainers before his second at-bat after colliding with Gonzales near the on-deck circle in a collision with Gonzales, but stayed in the game and interim Angels manager Phil Nevin confirmed “he's OK.”\n\nGonzales (7-11) also took a comebacker off the foot as he snapped a two-game losing streak. David Fletcher doubled for two runs in the three-hit fourth inning and added another RBI in the sixth to cut Seattle’s lead to 6-3. But Gonzales reached a season-high 91 mph a couple of times after the incidents, giving up a walk and eight hits, to lead Seattle to its second win in three games\n\n“Guys were joking that I need to get beat up before the game apparently,” Gonzales joked. “But I’d vote against that.”\n\nAndrés Muñoz, Penn Murfee and Paul Sewald combined for three scoreless innings of relief as Seattle improved to an AL-best 22-9 in its last 31 games. Sewald earned his 14th save in 17 attempts.\n\nLos Angeles starter Tucker Davidson (1-3), in his first appearance since being acquired from the Atlanta Braves on Tuesday, walked five and struck out one in an uneven start over four innings. He gave up six earned runs and six hits.\n\n“He showed us some flashes of some stuff that we heard about,” Nevin said. “... I can understand being nervous coming to your ... first time pitching for a new team, and I think that'll calm down his next time out.”\n\nTy France and Mitch Haniger hit consecutive one-out singles in the third inning before Davidson walked Suárez, loading the bases for Winker. The left fielder bent a 2-0 pitch around the right-field foul pole for a 5-1 lead. Sam Haggerty added a run-scoring double in the fifth.\n\nAll those hits were clutch, something the Mariners have struggled with all season.\n\n“I try to remind myself that you know the pressure is on\" the pitcher, Winker said. “It’s just my job to put a good swing on the ball and obviously those are three clutch at-bats in a time of the game where we needed them. ... That was the story of the game for sure.\"\n\nOHTANI INJURED?\n\nOhtani and Gonzales collided as the pitcher attempted to back up home plate in the third inning on a throw from the outfield. Ohtani drifted toward the field of play while watching events unfold as Gonzales backpedaled into position.\n\n\"I felt bad,” Gonzales said. “I crushed his foot and luckily didn’t roll my ankle too bad and was able to keep going.”\n\nGonzales also got a visit from the trainer and stayed in the game. Ohtani struck out in that at-bat, but appeared to have a bit of a limp after reaching base on a single in the fifth inning.\n\nOhtani struggled in the four-game series against the Mariners, going 2-for-16 with seven strikeouts.\n\n“Just a little spike on the top of the foot,” Nevin said. “He's OK.”\n\nROSTER MOVE\n\nThe Angels claimed OF Steven Duggar on waivers from Texas and designated OF Dillon Thomas for assignment.\n\nTRAINER’S ROOM\n\nAngels: OF Mickey Moniak, a top rookie prospect acquired from the Philadelphia Phillies this week in part of the deal for pitcher Noah Syndergaard, will miss at least eight days after fracturing the tip of his left middle finger in the ninth inning of Saturday’s 7-1 night-cap win over Seattle. Moniak and the team said he also received six stitches after a ninth-inning bunt attempt that went wrong. He’ll be re-evaluated when the stitches are removed in eight to 10 days and could be back in the lineup at that point.\n\nMariners: CF Julio Rodriguez (right wrist contusion) took batting practice before Sunday’s game with a lighter bat. Servais said he was still a little bit sore but progressing. He’s been out since July 31 and is eligible to return Aug. 10. … Servais said RHP Diego Castillo (right shoulder inflammation) is preparing to make a rehab appearance at Double-A Everett. He also could return as soon as Aug. 10.\n\nUP NEXT\n\nAngels: LHP Jose Suarez (3-4, 4.55 ERA) takes the mound Monday when L.A. travels to Oakland. He will be going for his second straight win against the Athletics and has not allowed an earned run in his last 11 innings.\n\nMariners: RHP Logan Gilbert (10-4, 3.09) takes the mound in the series opener against the New York Yankees on Monday. Gilbert gave up 6 earned runs and seven hits in 5 1/3 innings in his last start, Aug. 2 against the Yankees in New York.\n\n------\n\nMatt Olson launches a beauty to left field to give the Braves a 4-2 lead in the top of the fifth inning.\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\n"
	},
	{
		"id": 6,
		"title": "Detmers, Fletcher help Angels split DH with M's; Moniak hurt",
		"date": "08/06/2022 10:42 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Reid Detmers pitched seven smooth innings, Mickey Moniak hit his second home run in three days before getting injured, and the Los Angeles Angels defeated the Seattle Mariners 7-1 on Saturday night to split their doubleheader.\n\nDavid Fletcher homered and drove in three runs for the Angels, who dropped the opener 2-1 as Ty France hit a two-run homer and George Kirby struck out eight over six innings for Seattle.\n\nIn the nightcap, Taylor Ward got the scoring started in the third with an RBI double that drove in speedy Magneuris Sierra from first base. Ward came home later in the inning on Max Stassi's single.\n\nMoniak launched a solo shot in the fourth, making it 3-0 with his third major league homer.\n\nThe top pick in the 2016 amateur draft, Moniak was acquired from Philadelphia at Tuesday's trade deadline in a deal for pitcher Noah Syndergaard. The 24-year-old outfielder also went deep Thursday against Oakland, but began the day a .131 career hitter in 99 at-bats over 50 big league games.\n\nMoniak exited after taking a pitch off his finger in the ninth inning on a bunt attempt. He went for X-rays, and Angels interim manager Phil Nevin was not expecting good news.\n\n“It’s not looking good,” Nevin said. “I’m crushed for him, but it’s a part of the game.”\n\nLuis Torrens put the Mariners on the board in the fifth with a home run to right-center against Detmers, his first of the season.\n\nDetmers (4-3) was dominant early, allowing just one hit through four innings. After the hiccup in the fifth, the rookie left-hander settled back in. He permitted six hits overall and struck out seven.\n\n“He was awesome. You’re seeing a really good one just growing before our eyes,” Nevin said. “Pitching deep into a game like that, being able to get out of a jam there in the seventh, and reaching back out against the guy who hit the ball hard against him a couple times. It was a big outing for him.”\n\nFletcher extended the Angels' lead to 5-1 with a two-run homer off starter Chris Flexen in the sixth.\n\n\"It’s always huge when we have run support,” Detmers said. “The last couple outings, I’ve had run support. We got on the board early and credit to them, they just kept going.”\n\nFlexen (7-9) pitched six innings, allowing five earned runs on six hits and two walks with five strikeouts.\n\nMariners reliever Matt Brash tossed a scoreless seventh, but lefty Brennan Bernardino allowed two runs in the ninth — one on an RBI single from Fletcher, the other on a bases-loaded sacrifice fly by Shohei Ohtani.\n\nIn the first game, Moniak gave the Angels a one-run lead with an RBI single in the second, but France’s third-inning homer into the left-field bullpen put the Mariners ahead for good. The go-ahead drive was France’s 14th homer of the season and his 300th hit with the Mariners.\n\n“That I was able to pull a hanging slider just shows that I was on time for a fastball,” France said. “That is the biggest key. If I can get on time for a fastball, I’m going to be in a good spot, and I feel like I’m getting there again.”\n\nKirby (3-3) got the win, while Jaime Barria (1-2) was tagged with the loss in his first start this season. Erik Swanson pitched the ninth for his third save.\n\nIt was Kirby’s second victory since being recalled from Triple-A Tacoma on July 23. The Mariners optioned him down on July 9 to limit the rookie’s workload.\n\n“He’s looked great,” Seattle manager Scott Servais said. “After we shut him down and gave him a little breather, he has come back and has thrown very well. The velo is still there, the secondary stuff is there, and he has looked strong. That is exactly what we need out of him going forward.”\n\nTRAINER'S ROOM\n\nMariners: OF Mitch Haniger (ankle) was activated from the 60-day injured list prior to the second game and penciled into the No. 3 spot in the lineup. Haniger had been out since sustaining a high right ankle sprain against Miami on April 29. In a corresponding move, INF Abraham Toro was optioned to Tacoma.\n\nUP NEXT\n\nAngels: LHP Tucker Davidson (1-2, 6.46 ERA) starts Sunday after being obtained from Atlanta at Tuesday's trade deadline. Davidson has allowed 11 earned runs, 15 hits and 13 walks in 15 1/3 innings this season with 10 strikeouts.\n\nMariners: LHP Marco Gonzales (6-11, 3.95) gave up six earned runs and nine hits at Yankee Stadium on Monday.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nAlex Bregman launches a 2-run shot to left field to give the Astros a 5-0 lead in the bottom of the fifth inning.\n\n"
	},
	{
		"id": 7,
		"title": "France hits 2-run HR, Kirby sharp as Mariners top Angels 2-1",
		"date": "08/06/2022 04:17 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Ty France hit a two-run homer into the left-field bullpen in the third inning, George Kirby pitched six solid innings and the Seattle Mariners beat the Los Angeles Angels 2-1 Saturday to open a doubleheader.\n\nFrance’s homer came with two outs against starter Jaime Barria (1-2) and erased a one-run lead that came from Mickey Moniak’s second-inning RBI single.\n\nThe go-ahead blast, which was France’s 300th hit with the Mariners, came one day after he had a tying single in the ninth during a 4-3, 10-inning loss to the Angels.\n\nFrance has 14 homers on the season.\n\n“That I was able to pull a hanging slider just shows that I was on time for a fastball,” France said. “That is the biggest key. If I can get on-time for a fastball, I’m going to be in a good spot, and I feel like I’m getting there again.”\n\nBarria, making his first start of the season, went 4 2/3 innings while allowing three hits, two earned runs and four walks with three strikeouts.\n\nHe was pulled after 76 pitches in favor of right-hander Mike Mayers after loading the bases with back to back walks in the fifth. Mayers retired Eugenio Suarez on a pop-out to end the threat.\n\n“I love what I saw,” Angels interim manager Phil Nevin said. “Mike was able to come in and get him out of the fifth, but for him to go that far and for those two guys to get the load on this game, it really helps us for Game 2.”\n\nKirby (3-3) pitched well after a bumpy second inning, allowing six hits, one earned run and no walks with eight strikeouts. Saturday’s outing was the third time this season Kirby has pitched at least six innings and allowed no walks.\n\nThe six-inning outing was Kirby’s second win since being recalled from Triple-A Tacoma on July 23. The Mariners optioned Kirby to Tacoma on July 9 to limit the rookie’s workload.\n\n“He’s looked great,” Seattle manager Scott Servais said. “After we shut him down and gave him a little breather, he has come back and has thrown very well. The velo is still there, the secondary stuff is there, and he has looked strong. That is exactly what we need out of him going forward.”\n\nAndres Munoz struck out three in relief, and Erik Swanson pitched the ninth for his third save.\n\nROSTER MOVES\n\nMariners LHP Brennan Bernardino was added to the roster as the Mariners’ 27th man. Bernardino made his major league debut for the Mariners on July 31 at Houston after being signed earlier this year out of the Mexican League.\n\nRHP Oliver Ortega was the 27th man for the Angels.\n\nTRAINER’S ROOM\n\nMariners: OF Mitch Haniger (ankle) was back in the clubhouse before the first game on Saturday and could be activated in time for Game 2. Haniger has been out since April 30 with a high right ankle sprain.\n\nAngels: INF David Fletcher (foot) will play in Saturday’s nightcap after sitting out the past two games with a foot injury.\n\nUP NEXT\n\nMariners: RHP Chris Flexen (7-8, 3.73) will pitch the second game for Seattle. Flexen allowed three hits and two earned runs against the Astros in his last start on July 30.\n\nAngels: LHP Reid Detmers (3-3, 3.63) is on the mound for the Angels in the nightcap. Detmers allowed just three hits and one earned run over seven innings on July 31 against Texas.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nAlex Bregman launches a 2-run shot to left field to give the Astros a 5-0 lead in the bottom of the fifth inning.\n\n"
	},
	{
		"id": 8,
		"title": "Angels blow late lead, rally in 10th for 4-3 win over M's",
		"date": "08/05/2022 10:52 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — A night after hitting seven home runs and losing, the Los Angeles Angels needed just one long ball to hold off one of the hottest teams in baseball.\n\nTaylor Ward's sacrifice fly scored Magneuris Sierra in the 10th inning, and the Angels blew a three-run lead late before pulling out a 4-3 win over the Seattle Mariners on Friday night.\n\nThe Angels led 3-0 going to the bottom of the ninth before Seattle scored three times with two outs to force extra innings.\n\n“It was a well played game in all facets,” Angels interim manager Phil Nevin said. “We swung the bats well, didn't punch a bunch across, but got the important ones when needed.”\n\nWard's fly ball off Paul Sewald (3-3) was deep enough for Sierra to score easily and give the Angels the lead. Jimmy Herget pitched a perfect bottom of the 10th to get the save.\n\nMax Stassi hit a two-run homer in the top of the ninth inning to give the Angels a 3-0 lead that proved critical when Seattle rallied for three runs in the bottom of the inning.\n\n“Really impressed with those big hits late in the game like that when you haven't done much offensively. These guys stepped up,” Seattle manager Scott Servais said.\n\nSeattle's three-run rally in the ninth started when Jesse Winker walked with one-out against Jesse Chavez (2-1). Pinch-hitter Jake Lamb singled, and with two outs, Adam Frazier doubled to score Winker.\n\nTy France dribbled a single into center field to score Lamb and Frazier and pulled the Mariners even at 3-3. Seattle had three hits through the first eight innings, then strung together three in the ninth.\n\n“He's a veteran guy. He's done this before. He's going to pitch some big innings late. He got a groundball there, it just got through,” Nevin said of using Chavez in the ninth.\n\nIt was the first matchup between the teams since their wild brawl on June 26 that resulted in multiple suspensions and a couple of injuries. Both Servais and Nevin said pregame the incident was in the past.\n\nThe Mariners' rally ruined the night for Angels starter Patrick Sandoval, who was in line for his first victory since May 22. Sandoval threw 5 1/3 shutout innings relying heavily on offspeed pitches, and Aaron Loup and Jose Quijada kept the shutout going into the ninth.\n\n“I wanted to go in with my best pitches and play the odds with the best stuff I got,” Sandoval said. “So, slider, changeup, is primarily my best two pitches so I'm going to throw them as much as I can.”\n\nPitching was the story of the night until the ninth inning for both sides. Sandoval stymied the Mariners into the sixth, while Seattle starter Robbie Ray was terrific for seven innings with 10 strikeouts.\n\nThe only damage against Ray came in the first inning when Luis Rengifo doubled and Jo Adell followed with a broken-bat single to give the Angels the early lead.\n\nRay was otherwise dominant after getting roughed up in his previous two starts, both against Houston. Ray scattered five hits and had his sixth start this season with at least 10 strikeouts.\n\n“I think for me, more than just getting back on track, I feel like I've kind of found something with my delivery over the last week, just really getting into my lower half, and really feeling my drive down the mound,” Ray said.\n\nROSTER MOVES\n\nFormer Angels IF David MacKinnon was claimed off waivers today by Oakland. MacKinnon had been designated for assignment on Tuesday.\n\nSeattle added Lamb to the roster and designated for assignment OF Travis Jankowski. Lamb was acquired from the Los Angeles Dodgers ahead of the trade deadline and now gets the chance to play for his hometown team.\n\n“I feel like I’ve gotten chills the past two days over and over and over,” Lamb said.\n\nTRAINER’S ROOM\n\nAngels: IF David Fletcher was out of the lineup after getting hit in the foot by a pitch in Thursday’s game against Oakland. He’s expected back in the lineup on Saturday.\n\nMariners: OF Julio Rodriguez (wrist) is expected to pick up his baseball activity this weekend and should not need to go out on a rehab assignment when his stint on the injured list ends. ... IF/OF Dylan Moore (back spasms) is quickly improving and could be ready when his time on the IL ends. ... RHP Diego Castillo (shoulder) threw a bullpen on Friday. ... LHP Matthew Boyd (elbow), acquired at the trade deadline, will likely throw a live batting practice early next week before going out on a rehab assignment.\n\nUP NEXT\n\nAngels: The Angels will start RHP Jaime Barria (1-1, 2.55) in the first game of the doubleheader.\n\nMariners: RHP George Kirby (2-3, 3.56) makes his 15th start of the season. Kirby has been under pitch limits in his last two starts coming out of the All-Star break. Kirby allowed two runs struck out seven in four innings in his last start against Houston.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 9,
		"title": "Castillo, early power send Mariners past Cole, Yankees 7-3",
		"date": "08/03/2022 01:12 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "NEW YORK -- — Luis Castillo pitched five-hit ball into the seventh inning in his Seattle debut, and the Mariners used a fast start to beat Gerrit Cole and the New York Yankees 7-3 on Wednesday.\n\nEugenio Suárez, Carlos Santana and Jarred Kelenic homered against Cole (9-4) during Seattle’s six-run first. Jesse Winker connected against Wandy Peralta in the seventh, helping the Mariners match their season high for homers.\n\n“It was just another Luis Castillo start,” said Winker, who played with the pitcher in Cincinnati. “He did great. First start here, I’m sure he was fired up and excited and he did his thing.”\n\nCastillo (5-4) struck out eight in 6 2/3 innings in his second start in the Bronx in less than a month. The right-hander allowed three runs and walked three.\n\n“It was a little emotional ... but that did not distract me from my routine,” Castillo said through a translator.\n\nCastillo threw 109 pitches, 66 for strikes. He has struck out eight batters in each of his last four starts.\n\n“Thought he was awesome,” Seattle manager Scott Servais said. “Couldn’t be any more excited about what he’s going to bring to our ballclub, the stability, taking the ball every fifth day and the confidence and the stuff.”\n\nThe 29-year-old Castillo pitched seven sparkling innings for Cincinnati at New York on July 14. The Reds traded the ace to the Mariners on Friday night for four prospects.\n\nThe Yankees were reportedly in the mix for Castillo, but they acquired right-hander Frankie Montas in a trade with Oakland on Monday.\n\n“They were one of the teams that was very interested in me, but I’m here with the Mariners now and just got to keep moving forward and now I’m here to take this team as far as I can,” Castillo said.\n\nCastillo got some help from shortstop J.P. Crawford, who made a pair of impressive defensive plays.\n\nCrawford cut down Isiah Kiner-Falefa with a strong relay throw when he tried to score from first on a double by Kyle Higashioka. Crawford also speared a 106.5 mph liner by Aaron Hicks to open the fifth while shifted to the right of second base.\n\nCastillo retired 10 straight before issuing consecutive walks to DJ LeMahieu and Josh Donaldson in the sixth. But he got out of the jam by striking out Josh Donaldson on a slider and retiring Andrew Benintendi on a liner to second.\n\nCastillo cruised into the seventh at 95 pitches and easily got the first two outs. He allowed a single to Kiner-Falefa and exited after Higashioka hit a two-run homer.\n\nCole was booed at various points of the first when Ronald Marinaccio began warming up. He allowed seven hits, struck out eight and walked one in six innings.\n\n“Just a tough inning where he was struggling to I think to just find his command and his rhythm and getting all his pitches,” Yankees manager Aaron Boone said. “Unfortunately we're behind the eight ball there and then pitched really well from there.”\n\nIt was the second time he allowed three homers in the first inning this season. Cole allowed three straight homers in the first and five total for his outing during the Yankees' 10-7 win at Minnesota on June 9.\n\n“There were bad pitch selections,” Cole said. “There were some bad pitches and we got punished for it again.”\n\nThe Mariners took a 3-0 lead when Suárez hit a first-pitch slider into the seats in left for his second straight homer in the opening inning. Santana followed with his 10th homer, driving a 3-1 fastball deep to right-center field.\n\nAfter Seattle hit back-to-back homers for the second time this season, Crawford singled before Kyle Lewis struck out. Kelenic then made it 6-0 by reaching the short porch in right for his first homer since returning from spending over two months in the minors.\n\n“It was a great day for us,” Winker said.\n\nTRAINER’S ROOM\n\nMariners: 1B Ty France missed a fourth straight game with a sore left wrist. ... RHP Ken Giles (right shoulder tightness) struck out two and threw 12 pitches in a rehab appearance for Single-A Everett on Tuesday. ... Newly acquired INF Jake Lamb will join the team Friday.\n\nYankees: Montas was placed on the bereavement list and will make his Yankees debut Sunday in St. Louis. ... LHP Zack Britton (left elbow) faced batters at the team’s spring training complex in Florida for the first time since he underwent Tommy John surgery last September.\n\nUP NEXT\n\nMariners: LHP Robbie Ray (8-8, 4.11 ERA) opens a three-game series against the Angels on Friday in Seattle.\n\nYankees: LHP Nestor Cortes (9-3, 2.53 ERA) opens a three-game series Friday in St. Louis.\n\n------\n\nMatt Olson launches a beauty to left field to give the Braves a 4-2 lead in the top of the fifth inning.\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\n"
	},
	{
		"id": 10,
		"title": "Haggerty hits pinch homer and M's hang on to beat Yanks 8-6",
		"date": "08/02/2022 08:24 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "NEW YORK -- — Pinch-hitter Sam Haggerty opened the seventh inning with a go-ahead homer, Andrés Muñoz escaped a bases-loaded jam in the ninth and the Seattle Mariners hung on for a 8-6 victory over the New York Yankees on Tuesday night after blowing a four-run lead.\n\nThe switch-hitting Haggerty batted for left-handed hitting Jarred Kelenic against left-hander Lucas Luetge (3-4) and broke a 6-6 tie by lifting a 1-0 cutter into the left-field seats.\n\nHaggerty homered two days after getting stiches above an eye, an injury sustained when he was hit by his helmet, thrown after he failed on a bunt.\n\n“The stiches didn’t play too much of a in it,” Haggerty said. “Hitting a home run at Yankee Stadium is pretty cool, probably something every kid dreams of. I was fortunate enough to get a good pitch and put a barrel on it.”\n\nHaggerty, who had been 0 for 10 as a pinch hitter in his big league career. connected after Josh Donaldson hit a tying two-run homer in the sixth off Logan Gilbert, Donaldson’s first homer since July 8.\n\n“We gave him a couple of days off but Hags has a way of impacting the game in a number of different ways when he gets in there,” Seattle manager Scott Servais said.\n\nMuñoz, throwing at up to 102.6 mph, loaded the bases with two outs after DJ LeMahieu singled, and Aaron Judge and Anthony Rizzo walked. Muñoz, struck out pinch-hitter Gleyber Torres on a slider for his second save.\n\n“Tonight was a big learning experience for me,” Muñoz said through a translator.\n\nSeattle is 5-8 since entering the All-Star break with 14 straight wins.\n\n“That was the epitome of a team win if we’ve had one,” Servais said. “Everybody chipping in.”\n\nEugenio Suárez and Cal Raleigh hit early homers off Jameson Taillon, who allowed four walks — all of whom scored. Taillon gave up six runs — five earned — in 4 2/3 innings, pitching after New York traded fellow starter Jordan Montgomery to St. Louis for Gold Glove-winning center fielder Harrison Bader.\n\n“I think we’re significantly better,\" Yankees manager Aaron Boone remarked, “but as I said all along, we’re better in name and paper only now. It’s on us to go prove it.”\n\nSeattle also made moves before the game, acquiring two injured players from San Francisco in left-hander Matthew Boyd and catcher Curt Casali. The Mariners also picked up infielder Jake Lamb from the Los Angeles Dodgers.\n\nSuárez hit a two-run drive three batters in, and Raleigh reached Monument Park in the second.\n\nCarlos Santana drove in three runs, a night after getting his 1,500th hit. He hit a sacrifice fly to give Seattle a 4-0 lead in the third and added two-run double in the fifth.\n\nAdam Frazier hit an RBI single in the ninth off Albert Abreu. Lou Trivino then made his Yankees debut, pitching to catcher Jose Trevino.\n\nScott Effross, another reliever obtained by New York this week, entered in the seventh in his Yankees debut.\n\nDonaldson, who entered in a 3-for-32 slide, hit an RBI double to start a three-run fourth. Trevino hit a two-run homer and raised his season total to 10 — one more than his career total entering the year.\n\nRizzo started the sixth by homering in a fourth straight game. After a single by Matt Carpenter, Donaldson tied it by hitting a first-pitch fastball into the New York bullpen.\n\nGilbert allowed six runs and seven hits in 5 1/3 innings.\n\nPenn Murfee (2-0) allowed a double to Trevino and an infield single to Isiah Kiner-Falefa before getting Aaron Hicks on a double play to the end the sixth.\n\nTRAINER’S ROOM\n\nMariners: 1B Ty France took swings off a tee in the batting cage and missed a third straight game with a sore left wrist.\n\nYankees: RHP Luis Severino (right lat) played catch from 90 feet and said he was surprised to be transferred to the 60-day IL on Monday. “I was not happy. I was not expecting that,” Severino said. “If that’s the plan they have for me to come back healthy, I have to just follow the plan.”… RHP Frankie Montas will be activated during this weekend’s three-game series in St. Louis. … The Yankees optioned RHP Carlos Espinal to Triple-A Scranton/Wilkes Barre and recalled OF Tim Locastro from Triple-A. … C Ben Rortvedt, who injured his oblique in spring training, was activated from the 60-day IL and optioned to Triple-A.\n\nUP NEXT\n\nRHP Luis Castillo (4-4, 2.86 ERA) makes his debut for the Mariners on Wednesday against New York ace Gerrit Cole (9-3, 3.30). Castillo is pitching in the Bronx for the second time in nearly three weeks. He took a no-hit bid into the sixth inning of his start for the Reds on July 14.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 11,
		"title": "Judge hits 43rd HR, Yanks beat Ms 7-2 for winning home mark",
		"date": "08/01/2022 07:30 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "NEW YORK -- — Aaron Judge hit his major league-leading 43rd home run, Jose Trevino had his first multihomer game and the New York Yankees beat the Seattle Mariners 7-2 Monday night in a series opener between teams bulking up for the postseason.\n\nAnthony Rizzo started the onslaught with a three-run homer in the first, and New York clinched its 31st consecutive winning record at home (41-13), second only to its big league standard of 47 in row from 1918-64. The Yankees are 70-34, the first team to reach 70 wins this year.\n\nBefore the game, the Yankees acquired starter Frankie Montas and reliever Lou Trivino from Oakland, three days after Seattle obtained Luis Castillo, perhaps the best available starter on the trade market. Castillo is lined up to start the series finale on Wednesday against Yankees ace Gerrit Cole.\n\n“Just a dominant starter, been a dominant starter for quite a while now,” Judge said of Montas. “He’s got some ridiculous stuff and just happy that we don’t have to face that down the road again.”\n\nRizzo put the Yankees ahead in the first with a three-run homer off Marco Gonzales (6-11). The drive over the Yankees’ bullpen in right was Rizzo’s fourth homer in six games and raised his season total to 26 along with 65 RBI.\n\n“It’s a really good hitter that’s finding a little groove,” manager Aaron Boone said. “He’s been working hard on kind of finding that sweet spot.”\n\nAfter Kyle Lewis’ solo homer in the second against Domingo Germán (1-1), Judge hit a two-run drive in the bottom half. Judge also leads the majors with 93 RBI.\n\nTrevino homered in the fourth and added a drive into Monument Park in the eighth against Ryan Borucki. The first-time All-Star has his nine homers this year, matching his total in four previous big league seasons, and set a career high with 32 RBI.\n\nSeattle has lost seven of 11 since heading into the All-Star break on a 14-game winning streak.\n\nAdam Frazier hit a run-scoring single in the fourth off Germán, who won for the first time in three starts since coming off the injured list. He allowed two runs and six hits in five innings with three walks and a strikeout.\n\nWith Alex Rodriguez seated behind home plate, Judge hit a 420-foot drive, sending a first-pitch 87.4 mph fastball into the visiting bullpen in left field, after doubling on the first pitch he saw ahead of Rizzo’s homer.\n\n“It’s fun watching what he’s doing right now,” Boone said. “So I think obviously that was part of his game plan tonight, being aggressive. Got what he was looking for in the first couple of at-bats and put great swings on it.”\n\nJudge is on pace for 67 homers, six more than the Yankees record set by Roger Maris in 1961. Judge reached 43 homers in his 101st game and New York’s 104th game while Maris hit his 43rd in his 114th game and the Yankees’ 115th on Aug. 12, 1961.\n\nHe joined Barry Bonds (2001), Mark McGwire (1998) and Babe Ruth (1921) as the fourth player to hit at least 43 homers in his team’s first 104 games.\n\n“Aaron Judge is having a monster season and you have to be really fine and execute on the edges with your fastball, and we weren’t able to do that,” Seattle manager Scott Servais said.\n\nEligible for free agency after the World Series, Judge has 10 homers in 12 games since the All-Star break ad 13 in his last 16 games.\n\nRon Marinaccio, Aroldis Chapman, Jonathan Loáisiga and Wandy Peralta combined for one-hit, scoreless relief.\n\nGonzales allowed six runs for the first time since giving up seven on July 3 last year at Texas. He yielded nine hits in 5 1/3 innings and for the second time in three starts matched his career high of three homers allowed.\n\nMEETING CASTILLO\n\nLuis Castillo reported to Seattle after being acquired from Cincinnati on Friday night for four prospects and threw a bullpen session in front of an audience of teammates and coaches.\n\n“Guys were very excited about what they saw there, as they should be,” Servais said. “He’s got elite stuff.”\n\nCastillo also faced the Yankees with the Reds on July 14, when he took a no-hit bid into the sixth.\n\nMARINERS MOVES\n\nSeattle traded LHP Anthony Misiewicz to Kansas City for cash. Misiewicz was 0-1 with a 4.61 ERA in 17 appearances before being designated for assignment Sunday. The Mariners also claimed OF Travis Jankowski off waivers from the Mets, who designated him for assignment Friday. Jankowski batted .167 in 43 games with the Mets.\n\nTRAINER’S ROOM\n\nMariners: 1B Ty France missed a second straight game with a sore left wrist. Manager Servais said France is feeling better but is not ready to swing yet.\n\nYankees: RHP Luis Severino (right lat) threw for the first time since going on the injured list July 14. Severino was also transferred to the 60-day IL along with RHP Miguel Castro (right shoulder strain). ... RHP Clarke Schmidt was optioned to Triple-A Scranton/Wilkes Barre and RHP Carlos Espinal had his contract selected from Scranton.\n\nUP NEXT\n\nSeattle RHP Logan Gilbert (10-4, 2.78 ERA) opposes New York RHP Jameson Taillon (10-2, 3.72) Tuesday.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 12,
		"title": "Alvarez hits RBI single in 10th to lift Astros over M's 3-2",
		"date": "07/31/2022 02:40 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "HOUSTON -- — When the Seattle Mariners took a chance by pitching to Houston's Yordan Alvarez instead of walking him with two on and one out in the 10th inning Sunday, the All-Star slugger was determined to take advantage of the opportunity.\n\n“I just got focused and said I was going to be the one,\" he said in Spanish through a translator.\n\nAnd he was — hitting an RBI single to lift the Astros to a 3-2 win.\n\nMauricio Dubón started the 10th as the automatic runner on second and the Mariners intentionally walked Jose Altuve. Dubón advanced to third on a sacrifice fly by Yuli Gurriel.\n\nAlvarez then laced a grounder off Brennan Bernardino (0-1), who was making his MLB debut, to left field to send Dubón home and start the celebration.\n\n“Tough place to make your Major League debut in,” manager Scott Servais said. “Tough situation when they start with the guy on second and here comes the Astros' top of the lineup.\"\n\nHector Neris (4-3) pitched a scoreless 10th for the win.\n\nThe Mariners were playing without star rookie Julio Rodríguez, who was placed on the injured list with a bruised right wrist Sunday after being hit by a pitch a night earlier.\n\nThe AL-West leading Astros scored two runs in the first inning to take the lead. The Mariners, who are 12 games back in second place in the division, used a two-run homer by Jesse Winker in the eight inning to tie it.\n\nHouston’s win comes a night after Seattle scored two runs in the ninth to rally for a 5-4 victory. The victory gives the Astros a 3-1 advantage in the series.\n\n“Once they tied it up, I think we got a lot of energy,\" Alvarez said. “Then we told ourselves: ‘OK, we can’t lose today’s game like we did yesterday,' and that was kind of part of it.\"\n\nHouston led 2-0 and the Mariners had managed just two singles when Ryne Stanek walked Adam Frazier with two outs in the eighth inning. Winker sent his next pitch into the seats in right field for his ninth homer of the season, tying it a 2.\n\nThe Mariners couldn’t get anything going against Jake Odorizzi, who allowed two hits and struck out a season-high eight in seven scoreless innings. He didn’t allow a hit until Frazier singled to start the fourth, and he walked Carlos Santana with two outs in the inning. But Odorizzi retired Eugenio Suárez to end the inning and the Mariners didn’t have another baserunner until another single by Frazier with one out in the sixth.\n\nThis time Odorizzi retired the next two batters before walking one in a scoreless seventh to end his day.\n\n“He was very good today,\" manager Dusty Baker said. “He had good command of his fastball and that’s the best splitter that I’ve seen him have. He had good stuff today and it was good to see him go and complete the seventh.\"\n\nSeattle rookie George Kirby yielded three hits and two runs while striking out seven in four innings.\n\nKirby plunked Altuve to start Houston’s first and he advanced to third on a single by Gurriel. Alvarez struck out for the first out of the inning, but Gurriel stole second and Altuve stole home on the play to make it 1-0.\n\nAltuve slid in and tapped the base with his left hand just before catcher Cal Raleigh got the tag down to put the Astros on top.\n\nThere were two outs in the inning when Kyle Tucker singled on a grounder to right field to score Gurriel and extend the lead to 2-0.\n\nTRAINER’S ROOM\n\nMariners: The Mariners also placed Dylan Moore on the injured list Sunday after the outfielder started having back spasms Saturday night. ... Seattle recalled outfielder Jarred Kelenic from Triple-A Tacoma and purchased the contract of outfielder Jack Larsen from Double-A Arkansas to take the spots of Rodríguez and Moore on the roster. ... 1B Ty France Sunday didn’t play Sunday after having an MRI on his sore left wrist. Servais said the MRI showed no structural damage but that he might be out a few days because of swelling in his wrist. ... Utilityman Sam Haggerty was not in the lineup Sunday, but pinch-ran in the 10th after getting stitches above his eye. He was injured after being hit in the forehead by his thrown helmet after failing to bunt in the ninth inning Saturday and tossing his gear in frustration. The helmet bounced back up and hit him in the head.\n\nUP NEXT\n\nMariners: Seattle LHP Marco Gonzales (6-10, 3.66 ERA) opposes New York RHP Domingo Germán (0-1, 8.22) when the Mariners begin a three-game series against the Yankees Monday night.\n\nAstros: RHP Luis Garcia (8-6, 3.81) will start for Houston against RHP Nathan Eovaldi (4-3, 4.43) in the opener of a three-game series with Boston Monday night.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 13,
		"title": "Toro pinch-hits for hurt J-Rod, leads Mariners past Astros",
		"date": "07/30/2022 08:10 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "HOUSTON -- — Abraham Toro pinch-hit for injured All-Star Julio Rodriguez and delivered a two-run single with two outs in the ninth inning as the Seattle Mariners rallied past the AL-West leading Houston Astros 5-4 on Saturday night.\n\nRodriguez was hit on the back of the hand as he swung at a pitch in the top of the eighth inning. He struck out, but played in the field in the bottom half of the inning before being lifted in the ninth.\n\nSeattle manager Scott Servais said Rodriguez would get X-rays later Saturday.\n\n“He did not feel comfortable with a bat in his hand,” Servais said. “So, we’ll pray that it is not broke.”\n\nThe 21-year-old Rodriguez, who was 0 for 4 with three strikeouts, has 18 homers and 57 RBI and is batting .274 in his rookie season.\n\nThe Mariners beat Houston for the first time since June 8, snapping a five-game losing streak to the Astros.\n\nRyan Pressly (3-3) entered the ninth inning having converted 21 of his 24 save opportunities this season. Pressly gave up two runs on two hits, walked one and struck out two in the loss in his first blown save since June 23, which came against the New York Yankees.\n\n“He’s somebody that is generally aggressive, so I know he likes to attack the zone,\" Toro, who played parts of three seasons with Houston, said of Pressly. \"I was already swinging from the get-go.”\n\nAstros manager Dusty Baker added: “He has been a thorn in our side since we traded him over there. It was a big hit that he got tonight.”\n\nErik Swanson (2-0) pitched a scoreless eighth inning and earned the win, and Paul Sewald recorded his 13th save in 16 attempts.\n\n“We’ve had some crazy come-from-behind wins, crazy games since I’ve been here,” Servais said. “This one may be near the top of the list with all the stuff that happened and where we’re at.”\n\nSeattle starter Chris Flexen set down eight straight batters at one point, but didn't figure in the decision. Flexen allowed two runs on three hits with four walks and a strikeout in 5 1/3 innings. It was his third no-decision in his last eight starts.\n\nAledmys Diaz led off the fifth with a solo homer to left field. Diaz has hit three home runs in the last two games and nine for the season. Diaz finished 3 for 3 with two RBI.\n\nTrailing 3-2 in the seventh, Houston rallied with back-to-back doubles by Martín Maldonado and Jose Altuve and a single from Yuli Gurriel for a 4-3 lead.\n\nSeattle pushed across three runs on singles from Eugenio Suárez and Adam Frazier, and a fielder’s choice by J.P. Crawford in the first as Valdez hit two batters in the frame.\n\nValdez settled in after the first and allowed three runs on five hits, walking one and striking out seven in seven innings. It marks his majors-leading 18th quality start and his 17th straight, the second-longest streak in Astros history.\n\n“It was big for me being able to bounce back from something like that,\" Valdez said. \"Just showing the intensity and the focus that I can have after having a rough inning being able to pitch the rest of the game.”\n\nHELMET HURT\n\nSeattle's Sam Haggerty was hit in the forehead by his thrown helmet after he failed to bunt in the ninth inning and tossed his gear in frustration. The helmet bounced back up and hit him in the head.\n\nTRAINER’S ROOM\n\nMariners: LHP Tommy Milone was placed on the 15-day injured list on Saturday with a cervical muscle strain. As a result, LHP Brennan Bernardino was selected from Triple-A Tacoma and OF Marcus Wilson was designated for assignment. … OF Dylan Moore left Saturday’s game with back spasms.\n\nUP NEXT\n\nMariners: George Kirby (2-3, 3.50 ERA) is set to make his first start against the Astros on Sunday to close out the four-game series. Last time out, Kirby got a no-decision against Texas, giving up no runs on two hits and striking out four in five innings.\n\nAstros: Jake Odorizzi (4-3, 4.25 ERA) is slated to start Sunday, looking to get back on the winning side. Odorizzi’s last win came on July 10, at Oakland. Last time out, Odorizzi was tagged for six runs on seven hits in a loss to the Athletics.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 14,
		"title": "Verlander wins MLB-leading 14th, Astros rout Mariners 11-1",
		"date": "07/29/2022 08:39 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "HOUSTON -- — Justin Verlander pitched one-run ball into the eighth inning and won his MLB-leading 14th game, Aledmys Díaz hit two homers and Yordan Alvarez slugged his 30th home run of the season as the Houston Astros beat the Seattle Mariners 11-1 on Friday night.\n\nVerlander (14-3) allowed one run in 7 2/3 innings, with five hits and five strikeouts in outdueling Seattle’s Robbie Ray, last year’s AL Cy Young Award winner.\n\nVerlander held Seattle scoreless until Jesse Winker and Julio Rodríguez doubled in the seventh inning.\n\n“He didn’t have a lot of strikeouts, but he had them off balance,” Astros manager Dusty Baker said. “He was dealing. We got him some runs, and it’s hard sometimes for a pitcher who gets that kind of run support to still concentrate on getting the hitters out, but he’s a strong-minded guy. It was like the game was 0-0. He just kept pitching.”\n\nVerlander allowed just three earned runs in four starts and 26 2/3 innings in July. The 39-year-old right-hander, in his first season back from Tommy John surgery, has allowed one earned run or less in six straight starts.\n\nVerlander received a standing ovation as he walked off the field and tipped his hat to the packed house.\n\n“It was an amazing ovation,” Verlander said. “The fans are incredible. It felt really special to have them acknowledge me like that. A sellout crowd, per usual, and it’s just nice to go out and perform and have them support you like that.”\n\nAlso Friday, the Mariners made a move to strengthen their pitching, acquiring the top starting pitcher on the trade market, getting All-Star Luis Castillo from the payroll-paring Cincinnati Reds for four minor league prospects.\n\n“He’s one of the best pitchers in the game -- he’s really established himself as a dominant starter,” Mariners manager Scott Servais said. “We’ve got a chance to do something really big here this year. You have to step out and take a chance once in a while if you ultimately want to get the reward, take a little risk. Dominant starting pitcher, and I’m anxious to meet him.”\n\nCincinnati obtained infielders Noelvi Marte and Edwin Arroyo, and right-handers Levi Stoudt and Andrew Moore. Marte was the Mariners’ top-rated prospect, Arroyo was third and Stoudt fifth.\n\nSeattle has not been to the playoffs since 2001, the longest postseason drought in the four major North American professional sports.\n\nThe Astros chased Ray (8-8) by scoring three runs in the third inning. Ray gave up singles to Yuli Gurriel and Alvarez and a two-run double to Alex Bregman that put Houston up 4-0.\n\nDíaz sent a Ray pitch 401 feet onto the left-field train tracks in the second inning. Díaz added another solo homer in the eighth inning off catcher Luis Torrens.\n\n“The last month, I’ve been feeling great at the plate,” Díaz said. “I’m glad I got a chance to be in the lineup and contribute to the win.”\n\nRay worked just 2 2/3 innings, giving up five hits and four runs on 84 pitches. He has been hit hard by Houston this season, giving up 14 runs in 10 2/3 innings in three starts.\n\nBregman added another RBI in the fourth inning on a single off Penn Murfee to left-center that scored Gurriel to put Houston up 5-0.\n\nAlvarez’s homer to deep right-center field came in the sixth inning off an 85 mph fastball from Tommy Millone. Astros center fielder Mauricio Dubón also homered in the sixth, a shot near the left-field foul pole off Millone that put Houston up 9-0.\n\nHouston has won five straight against Seattle and leads the season series 11-6. The Astros are 34-19 against the AL West this season.\n\nSeattle is 17-5 in its last 22 games, with all five losses coming against Houston. The Mariners haven’t lost to a team except the Astros since July 1.\n\n“Obviously, not our night,” Servais said. “They were all over Robbie again. We just couldn’t get anything going. You’re going to have these games every once in a while, and we haven’t had a game like this in a long, long time.”\n\nVERLANDER EYEING ANOTHER CY YOUNG?\n\n“I can’t really put into words what that would mean,\" he said. \"All of this is just such a blessing after the last couple of years, with Tommy John. To be able to be back and be successful, there were a lot of doubters, but I just had to believe in myself, and my family had my back, and my teammates had my back. If that were to happen, that would be incredible.”\n\nYORDAN ‘APPROACHING EXCELLENCE’\n\n“I’ve been around some great hitters, and he’s fast approaching that area of excellence. Just keep it coming.” -- Astros manager Dusty Baker on Alvarez.\n\nMACHETE MALDONADO\n\nMariners OF Julio Rodriguez was caught trying to steal second base in the first inning by Astros catcher Martin Maldonado. Rodriguez leads AL rookies with 21 steals on 26 attempts, but Maldonado caught him for his eighth of the season on 25 attempts.\n\nTRAINER’S ROOM\n\nMariners: After RHP Diego Castillo was placed on the 15-day injured list on Thursday night with right shoulder inflammation, the Mariners recalled RHP Matt Brash from Triple-A Tacoma. On Friday, the team claimed RHP Phillips Valdez off waivers from Boston and optioned him to Tacoma.\n\nAstros: RHP Lance McCullers Jr. continues to make progress in his rehab from a forearm strain in the offseason. He will make his third rehab start on Tuesday night at Triple-A Sugar Land.\n\nUP NEXT\n\nMariners: Chris Flexen (7-8, 3.75) starts for Seattle on Saturday, hoping to close out an impressive July in which he has a 1.61 ERA in four starts, all of which the Mariners have won.\n\nAstros: Framber Valdez (9-4, 2.74) will start Saturday, six days after he held the Mariners to three runs in 6 2/3 innings in an 8-5 win in Seattle on Sunday.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 15,
		"title": "Bregman homers, has 3 RBIs to lead Astros over Mariners 4-2",
		"date": "07/28/2022 08:19 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "HOUSTON -- — After suffering their first series sweep of the season by Oakland, the Houston Astros were determined to get back on track against the Seattle Mariners.\n\nAlex Bregman's big night ensured that they did.\n\nBregman hit a two-run homer early, and his tiebreaking RBI double in the eighth inning led the Astros over the Seattle Mariners 4-2 on Thursday night.\n\n“It feels great,\" Bregman said. “A tough time over there (in Oakland), but I think this team does a good job of turning the page, and it was an example of that tonight.\"\n\nBregman was shaken up in a collision while scoring the Astros' final run in the eighth, but he remained in the game. He said afterward that he was fine and would be in the lineup Friday night.\n\nHis big performance came after manager Dusty Baker gave him a day off to rest Wednesday.\n\n“Sometimes you give guys a day off and they come back mentally and physically refreshed,\" Baker said. “It worked today. He was fresh, and we needed that from him.\"\n\nThe game was tied at 2 when Andrés Muñoz (1-4) hit Yuli Gurriel between the chest and shoulder with a 100 mph fastball to start Houston’s eighth. The impact caused Gurriel to stagger backward and his batting helmet to fly off, but he seemed OK and trotted to first base.\n\nGurriel stole second base with one out and Bregman, who homered in the first, doubled off the wall in left-center field for a 3-2 lead.\n\nBregman scored on a two-out wild pitch, colliding with a diving Muñoz as the reliever tried to make the tag.\n\nBregman stood up after the slide but immediately crumpled to the ground on his hands and knees. When Bregman got up again, he didn’t put any weight on his left leg, but he limped off as he talked to Baker and went to third base for the ninth.\n\nRafael Montero (4-1) got four outs without allowing a hit for the win and Ryan Pressly pitched a scoreless ninth for his 21st save in 24 chances.\n\nPressly had retired 32 consecutive batters, tying Justin Verlander for most in team history, when J.P. Crawford singled with two outs in the ninth. Pressly struck out Cal Raleigh to end it.\n\nTy France and Carlos Santana had an RBI each for the Mariners, who were coming off a sweep of the Rangers that came after they were swept by the Astros in their previous series.\n\n“Just another tight game with the Astros,\" manager Scott Servais said. “The last four we’ve played have been very, very close. Unfortunately we haven’t been able to do a whole lot offensively, but we had a few chances there. It was a tight game and a very well-pitched game.”\n\nThis game featured strong outings by both team's starters. Houston's José Urquidy allowed two runs and four hits with three strikeouts in 6 2/3 innings.\n\nSeattle’s Logan Gilbert yielded five hits while also allowing two runs and striking out six in six innings.\n\nThere were two outs in the first when Yordan Alvarez doubled to right field. Bregman then knocked his 13th homer into the seats in left to make it 2-0.\n\nAdam Frazier singled to start the third before Urquidy walked Dylan Moore and Julio Rodriguez to load the bases. The Mariners got within 1 when Frazier scored on a sacrifice fly by France.\n\nSeattle tied it when Moore scored on a groundout by Santana. Urquidy then retired Eugenio Suárez to limit the damage.\n\nRaleigh doubled to the corner of right field with one out in the seventh inning. There were two outs in the inning when Urquidy was replaced by Montero, and he retired Adam Frazier to end the threat.\n\nTRAINER’S ROOM\n\nMariners: RHP Diego Castillo was placed on the 15-day injured list, retroactive to Tuesday, with right shoulder inflammation. RHP Matt Brash was recalled from Triple-A Tacoma to take his spot on the roster.\n\nAstros: RHP Lance McCullers Jr. (forearm strain) made his second rehabilitation for Triple-A Sugar Lane Wednesday. He allowed three hits and two runs in three innings. The Astros have yet to announce what the next step is for McCullers, who has been out all season with the injury.\n\nTHEY SAID IT\n\nPressly on matching Verlander's record for consecutive batters retired: “Whenever you have your name next to his, you’re probably doing something good. So it’s an honor to be next to him. I just was trying to put zeros together and you look up and when you have that many strung together it’s nice.\"\n\nUP NEXT\n\nVerlander (13-3, 1.86 ERA), whose 13 wins lead the majors, opposes Robbie Ray (8-7, 3.90) when the series continues Friday night.\n\n------\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nAlex Bregman launches a 2-run shot to left field to give the Astros a 5-0 lead in the bottom of the fifth inning.\n\nLewin Diaz drives a ball to the outfield and brings in a run to extend the Marlins' lead over the Phillies.\n\n"
	},
	{
		"id": 16,
		"title": "Rodríguez HR again, 3-run shot in 7th, Mariners sweep Texas",
		"date": "07/27/2022 03:47 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Julio Rodríguez connected again, hitting a go-ahead, three-run homer in the seventh inning and the Seattle Mariners finished off a three-game sweep by beating the Texas Rangers 4-2 on Wednesday.\n\nA day earlier, the 21-year-old rookie sensation hit a leadoff home run in the first inning. That was his first swing since the All-Star Game because of a sore left wrist that was initially injured in the final game before the break in Texas.\n\nRodríguez had a breakout performance in the All-Star Home Run Derby, where he smashed 81 shots over the wall.\n\nThis home run was his 18th of the season and came with one out against starter Jon Gray (7-5). Gray had allowed just one run on four hits to that point, but the 416-foot drive into the left-field bullpen erased Seattle’s 2-1 deficit.\n\nThe dramatic moment came after Rodriguez switched bats, unhappy with the performance the other one had provided.\n\n“That’s Julio Rodriguez,” Seattle manager Scott Servais said. “That’s why it’s a fun game. He plays like a kid and he’s fun to be around every day.”\n\nFor the player they call “J-Rod,\" no moment seems too big.\n\n“I honestly love it, because at those moments I feel like everybody is on their feet, everybody is watching, and I just love those moments,” Rodriguez said. “I feel like if you’re not ready to perform in those moments, you’re not going to be having the best fun playing this game.”\n\nThe homer ended Gray’s day. He struck out eight and walked four.\n\n“(The pitch) slipped out of his hand,” Texas manager Chris Woodward said. “The only one all day. If he throws his best stuff, I don’t think Julio has a chance, and that kid is good.”\n\nAside from the dramatic homer, Rodriguez had another big moment in the top of the third when he made a running catch at the center-field wall on Elier Hernandez's flyball to end the inning.\n\nAfter the game, Seattle starter Marco Gonzales shook his head and laughed.\n\n“I think he’s the best player I’ve ever seen,” Gonzales said. “He’s for sure the best player I’ve ever played with.”\n\nGonzales (6-10) held the Rangers hitless through the first four innings while allowing just a single baserunner, with Adolis Garcia drawing a second-inning walk and later being forced out on an inning-ending double play.\n\nGonzales allowed four hits, struck out five and walked one.\n\nMatt Festa pitched a scoreless ninth for his second save.\n\nSeattle scored its first run in the second when Sam Haggerty drove in J.P. Crawford with a bloop double that barely stayed fair down the left field line.\n\nGarcia singled in the Texas fifth and scored on Charlie Culberson’s double. Jonah Heim hit an RBI double in the sixth to put Texas ahead 2-1.\n\nThe Mariners improved to 11-2 against the Rangers this year, and have won 17 of their past 20 games.\n\nTRAINER’S ROOM\n\nMariners: INF Ty France was out of the lineup after tweaking his left wrist on a swing in Tuesday’s game. Seattle manager Scott Servais said it is unrelated to France’s elbow injury from earlier in the season, and his status is day-to-day.\n\nUP NEXT\n\nMariners: RHP Logan Gilbert will start Thursday at Houston. Gilbert struck out eight, but allowed five hits and two earned runs in a 3-1 loss to Houston on Saturday.\n\nTexas: RHP Spencer Howard will pitch for the Rangers Thursday against the Los Angeles Angels. Howard allowed six hits and four earned runs over 4 ⅔ innings in his last start on July 22, against Oakland.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 17,
		"title": "Mariners get back to winning formula, hold off Rangers 4-3",
		"date": "07/25/2022 10:33 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — In the midst of their July surge back into playoff contention, it's become clear the Seattle Mariners have figured out how to succeed in one-run games.\n\nOn Monday night, it was a formula of good starting pitching, key baserunning and some more hot hitting from Ty France.\n\n“It really ends up defining your season finding ways to win games like tonight,” Seattle manager Scott Servais said.\n\nFrance launched his 13th home run as part of a three-hit night, Cal Raleigh added an RBI single and the Mariners rebounded from a rough weekend with a 4-3 victory over the Texas Rangers.\n\nErik Swanson escaped a ninth-inning jam and Seattle won for the 15th time in 18 games, a stretch of success interrupted over the weekend when the Mariners were swept at home by AL West-leading Houston following a 14-game winning streak. But Texas was a welcome visitor as the Mariners won their sixth straight over the Rangers and improved to 9-2 against them this season.\n\nSeattle also won its eighth straight game decided by one run and is 22-12 on the season. The last time the Mariners lost a one-run game was June 26 against the Los Angeles Angels.\n\n“We play so many of them that when the time comes we don’t fold into that pressure,” France said.\n\nFrance singled in his first two at-bats, but it was his solo shot to center field in the fifth inning off starter Glenn Otto that gave the Mariners a 3-1 lead. France has homered in three of his past five games, including Seattle’s last one before the All-Star break when he went deep off Otto (4-7) in Texas.\n\nRaleigh’s RBI single in the fourth drove in France, and the Mariners added another run in the inning when Eugenio Suárez scampered home on a wild pitch. Carlos Santana added an RBI groundout in the seventh.\n\nSeattle starter Chris Flexen won his fifth straight decision and extended his streak of allowing three runs or fewer to 11 consecutive starts.\n\nFlexen (7-8) pitched six innings, giving up two runs and four hits. He escaped a bases-loaded jam in the third with only one run allowed and yielded Adolis García's 18th homer on the first pitch of the sixth.\n\n“The thing with (Flexen), he’s never going to wow you. He’s just always going to keep you in the game,\" Servais said. “And I appreciate that. I think every manager appreciates those type of guys.”\n\nMariners reliever Diego Castillo ran into trouble in the ninth. Nathaniel Lowe led off with his 14th homer. Leody Taveras followed with a single and Kole Calhoun walked. Castillo struck out Ezequiel Duran before Swanson retired Josh Smith and Marcus Semien for his second save.\n\n“We've got to continue to have conversations and figure out OK, there’s a lot of little plays in there that we have to make,” Rangers manager Chris Woodward said. “They made some plays, we didn’t. They made some pitches, we didn’t. We had opportunities at the end. If we’re going to win games, we've got to find a way to get it done there.”\n\nOtto allowed three runs and seven hits over 5 1/3 innings, but has not earned a victory since beating the Mariners on June 4.\n\nTRAINER’S ROOM\n\nRangers: RHP Dane Dunning is expected to be activated from the injured list to start Tuesday. Dunning has been out since July 11 due to an impingement in his right ankle.\n\nMariners: Servais was hopeful All-Star CF Julio Rodríguez (wrist) would be back in the lineup Tuesday. Rodríguez was expected to increase his baseball activity and take swings before Monday’s game to see how the wrist responds. ... LF Jesse Winker was out of the lineup after spraining his right ankle in Sunday’s loss to Houston. The injury isn’t considered serious and Winker is expected back Tuesday. ... OF Mitch Haniger (ankle) will have his rehab assignment transferred to Triple-A Tacoma starting Tuesday. Haniger played last weekend for Class A Everett. He has been out since late April and said he still needs significantly more at-bats before he’d be ready to rejoin the major league club. “I think I just need quantity right now. Just playing,” Haniger said. “I can’t tell you when that will be.”\n\nUP NEXT\n\nRangers: Dunning (1-6, 4.42 ERA) will make his first start since July 10. He lasted just 2 1/3 innings and allowed four runs against Minnesota before landing on the injured list. He is winless in his past 13 starts.\n\nMariners: RHP George Kirby (2-3, 3.78) will make his first start since July 8. The rookie was optioned to the minors before the All-Star break in an attempt to control his innings.\n\n------\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nAlex Bregman launches a 2-run shot to left field to give the Astros a 5-0 lead in the bottom of the fifth inning.\n\nLewin Diaz drives a ball to the outfield and brings in a run to extend the Marlins' lead over the Phillies.\n\n"
	},
	{
		"id": 18,
		"title": "Astros start fast, batter Ray for 3-game sweep of Mariners",
		"date": "07/24/2022 05:12 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Jose Altuve and Jeremy Peña hit back-to-back home runs off Robbie Ray to begin the game, and the Houston Astros roughed up the reigning AL Cy Young Award winner in an 8-5 victory over the Seattle Mariners that completed a three-game sweep Sunday.\n\nMartín Maldonado had three RBI from the No. 9 spot in the lineup and All-Star lefty Framber Valdez (9-4) took a shutout into the seventh inning for the Astros, who won their fifth straight and increased their AL West lead to 13 games over second-place Seattle.\n\nThe Mariners had won 14 in a row before Houston arrived, but were stopped cold by the defending AL champions coming out of the All-Star break.\n\n“We played good ball,” Houston manager Dusty Baker said. “We held on a couple games, but our bullpen came through. Guys were operating on fumes, but they found some energy to win the game.”\n\nRay (8-7) was tagged for six runs and 10 hits in three innings. Altuve sent the first pitch of the game into the left-field bleachers, Peña followed with his 14th homer and the Astros were off and running.\n\nIt was Altuve’s 30th career leadoff homer. He leads the majors with eight this season.\n\n“I think (Peña's) homer was even better,” Altuve said. “Because that really set the tone for the other hitters.”\n\nHouston scored three more times on five consecutive hits to start the second, making it 5-0. In the third, Yuli Gurriel scored on a fielder’s choice.\n\nMeanwhile, the Mariners couldn’t get much going against Valdez until the seventh, when Sam Haggerty hit a two-run triple with two outs. J.P. Crawford drove in Haggerty with a double, and Valdez was replaced by Seth Martinez. He struck out Ty France to end the inning.\n\nMaldonado blooped a bases-loaded single into left field to score Alex Bregman and Aledmys Diaz in the eighth.\n\nAbraham Toro hit a two-run homer for Seattle in the bottom half.\n\nHouston closer Ryan Pressly returned from the paternity list and threw a perfect ninth inning for his 20th save. Pressly has retired 30 consecutive batters dating to June 25, setting a club record.\n\n“It sounds good, but you’re not really thinking about any of that when you’re out there,” Pressly said. “You’re just trying to get three outs and do it anyway you can.”\n\nIt was the second time this season the Astros swept the Mariners. The teams play a four-game series next weekend in Houston.\n\n“We got beat,” Seattle manager Scott Servais said. “They executed, they made pitches, they made plays, they got timely hits, and that is why they swept the series.”\n\nTRAINER'S ROOM\n\nAstros: All-Star DH Yordan Alvarez is nursing a sore right hand and was out of the starting lineup.\n\nMariners: Rookie OF Julio Rodríguez is still day to day with left wrist soreness. Rodriguez had an MRI on Saturday that revealed no damage other than bruising. ... OF Jesse Winker left in the fifth with a right ankle sprain, which came after he collided with Peña near first base in the second inning. Winker hopes to play Monday against Texas.\n\nUP NEXT\n\nAstros: RHP Jake Odorizzi (4-2, 3.56 ERA) will pitch at Oakland. Odorizzi’s past two starts also came against the Athletics.\n\nMariners: RHP Chris Flexen (6-8, 3.79) goes Monday against Texas. Flexen has allowed no more than one earned run in each of his last three starts.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 19,
		"title": "Verlander 1st 13-game winner, Astros beat Mariners 3-1",
		"date": "07/23/2022 04:25 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — Justin Verlander became the major leagues’ first 13-game winner, striking out nine and topping 99 mph in his final inning to lead the Houston Astros over the Seattle Mariners 3-1 on Saturday.\n\nVerlander (13-3) allowed four hits in seven innings to win his fifth straight start and lower his ERA to 1.86, second in the American League to Shane McClanahan’s 1.71 for Tampa Bay.\n\nA 39-year-old right-hander who missed last season while recovering from Tommy John surgery, Verlander averaged 96.3 mph with his fastball, 1.4 mph above his season average coming in.\n\n“I feel like I haven’t been able to let it go like that in a long time,” Verlander said.\n\nHe said he was throwing the ball recently on an off day and tried a different arm path. He saw positive results in his last start before the All-Star break.\n\n'It was a solid one tick up,” he said. “I was able to do that again today and a lot more times, so I’m definitely happy and a bit surprised. Surprise is the wrong word — I was hopeful that this this could happen.”\n\nVerlander retired 15 straight between Adam Frazier’s second-inning single and Carlos Santana’s ninth home run, which cut the lead to 2-1 in the seventh. Seattle loaded the bases on walks by Eugenio Suárez and pinch-hitter Kyle Lewis around Frazier’s single, and Verlander struck out No. 9 hitter Sam Haggerty on his 101st and final pitch, clocked at 97.4 mph.\n\nVerlander has allowed one earned run or fewer in seven of his last eight starts.\n\n“I remember the greats, Bob Gibson and (Tom) Seaver, and I told him, ‘You know, when they were in trouble, they knew how to pitch out of trouble,’” Houston manager Dusty Baker said. “The mark of a good pitcher is figuring out how to get either a double play or a popup or a strikeout, and I tell you, that one that was great. I mean, we needed that. He needed it. We’re operating on fumes today, so I’ll say that was a great victory.”\n\nKyle Tucker and Yuli Gurriel hit RBI doubles in the fourth to help the Astros to their fourth consecutive win and send Seattle to its second straight loss after a 14-game winning streak.\n\nHouston is 27-9 since June 12 and ended the Mariners’ streak of eight consecutive winning series.\n\nLogan Gilbert (10-4) gave up two runs and five hits in six innings with eight strikeouts and one walk. He struck out his first four batters, but gave up back-to-back doubles to Gurriel and Tucker with two outs in the fourth after his only walk, to Yordan Álvarez.\n\nJose Altuve scored on Ryan Boruki’s wild pitch in the eighth.\n\nBryan Abreu got three straight outs to finish the four-hitter for his second big league save, his first since May 26 last year.\n\n“We haven’t lost a series in a while,” Seattle manager Scott Servais said. “We’ve played so well. We’ve been getting all those big hits in those big moments. It just hasn’t happened the last couple of nights.”\n\nSANTANA\n\nSantana has nine homers against Verlander, a two-time Cy Young Award winner.”\n\nTRAINER’S ROOM\n\nAstros: Closer Ryan Pressly could return to an overused bullpen Sunday from paternity leave. ... RHP Lance McCullers Jr. (right forearm strain) made a rehab start Friday for Double-A Corpus Christi, striking out three over two innings. He threw 40 pitches, allowing a run. McCullers has missed the entire season. “I heard he had good velocity,” Baker said. “I heard he threw the ball well, and I’ve heard he’s very happy with his performance, especially the first time out. I’m sure he was a little nervous. But I’m waiting to hear today from our trainers to see if he has the aftereffects.”\n\nMariners: Servais said All-Star rookie Julio Rodríguez remains day to day after missing a second day due to a left wrist strain. The center fielder was not available off the bench Saturday, and Servais said he would remain out of the lineup until there was no soreness. Servais wasn’t sure when Rodríguez injured the wrist. He jammed it against the Rangers last Sunday sliding into second, but told Servais he wasn’t hurt afterward and appeared to participate in the Home Run Derby without issue. “If anybody’s ever been involved in an event like that — not many of us have — but the adrenaline rush just has to be out of this world, you know, with everybody on their feet and you’re doing your thing and you’re 21 years old,” Servais said. “And I’m guessing he felt that the next day after or something like that.”\n\nUP NEXT\n\nAstros: LHP Framber Valdez (8-4, 2.66 ERA) returns to the mound for the first time following his All-Star Game win. He struck out 10 over six scoreless innings during his last start, a 3-2 win over the Los Angeles Angels on July 14.\n\nMariners: LHP Robbie Ray (8-6, 3.54) is 4-0 in his last eight starts, matching his season high with 12 strikeouts at Texas on July 15.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 20,
		"title": "Astros end Mariners' winning streak at 14; J-Rod scratched",
		"date": "07/22/2022 10:35 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "SEATTLE -- — The Houston Astros ended the Seattle Mariners’ winning streak at 14 games, with Jose Altuve and Yordan Alvarez homering in a 5-2 victory Friday night.\n\nSeattle scratched breakout rookie Julio Rodríguez from the lineup moments before first pitch with left wrist soreness, then lost their first game since July 1. The club was one win shy of matching the 2001 Mariners for the longest winning streak in franchise history.\n\nHouston stretched its AL West advantage over second-place Seattle to 11 games.\n\n“The crowd was into it,” Astros manager Dusty Baker said. “They were trying to urge them on for No. 15. But I'm just glad that we held on and won the game.”\n\nAltuve led off the game with a homer against starter Marco Gonzales, Alvarez added another solo shot in the fourth, his 28th of the year, and Martin Maldonado connected in the fifth for a 3-0 lead.\n\nAlvarez scored Altuve with a sacrifice fly later in the fifth, and Jake Myers had an RBI single in the sixth for a 5-0 advantage.\n\nGonzales (5-10) was charged with all five runs over 5 2/3 innings, with nine hits allowed.\n\nTy France hit a solo homer for Seattle in the sixth inning against Jose Urquidy (9-4).\n\nUrquidy threw 105 pitches over six innings, allowing one earned run on four hits with three strikeouts.\n\nBaker was happy to get six innings out of Urquidy against the Mariners, who had already beaten him three times this season.\n\nIn his last start against Seattle on June 8, Urquidy allowed seven hits and five runs over 4 1/3 innings in a 5-3 loss.\n\n“He gave us six innings, and it didn’t look like it there for a while, because his pitch count got kind of high,” Baker said. \"So yeah, that was big for Urquidy and us.”\n\nUrquidy has now thrown seven straight quality starts.\n\nEugenio Suarez drew a bases-loaded walk in the eighth to pull the Mariners within three, but shortstop Jeremy Peña made a leaping grab to take away a hit from Kyle Lewis, and Houston pitcher Ryne Stanek struck out Cal Raleigh to end the threat.\n\n“I thought, ‘He has no chance,’” Altuve said of Peña’s leaping grab. “I think that was the play of the game. If that ball goes through, it’s probably a different story.”\n\nThe Mariners left nine runners on base.\n\n“Tonight was a ton of intensity,” Seattle manager Scott Servais said. “I loved our at-bats throughout the course of the game. We put a ton of pressure on them, we just couldn’t quite get the big hit.”\n\nJ-ROD SITS\n\nThe 21-year-old Rodríguez was pulled from the lineup days after a breakout show at the All-Star Home Run Derby.\n\nServais said that Rodriguez jammed his wrist on a stolen base attempt against Texas on Sunday, and his status is day-to-day.\n\nLEWIS UP, UPTON OUT\n\nSeattle activated outfielder Kyle Lewis from the seven-day injured list after he recovered from a concussion and optioned outfielder Justin Upton to Triple-A. Upton refused the assignment and elected free agency.\n\nLewis was hit in the head by a pitch from Urquidy on May 28.\n\nTRAINER’S ROOM\n\nMariners: OF Mitch Haniger (ankle) began a rehab assignment Friday with Class A Everett. Seattle placed Haniger on the IL on April 30, when he suffered a Grade 2 ankle sprain in a game against the Marlins. Haniger has played in just nine games this season.\n\nAstros: OF Michael Brantley (shoulder) could start hitting this week, according Baker. Brantley was placed on the IL on June 28 with shoulder discomfort.\n\nUP NEXT\n\nAstros RHP Justin Verlander faces Mariners RHP Logan Gilbert on Saturday. Verlander has an MLB-best 12 wins this season and a 1.89 ERA. Gilbert’s most recent start came against Texas on July 16, when he allowed four hits and one earned run over five innings.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 21,
		"title": "Mariners win 14th in row, Rodríguez key hit to beat Rangers",
		"date": "07/17/2022 03:17 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ARLINGTON, Texas -- — Julio Rodríguez and Ty France are headed to the All-Star Game, so they won't be among the Seattle Mariners getting the break their manager says they need.\n\nYeah, Scott Servais knows that time off thing sounds a little funny.\n\n“It’s hard to say you need a break when you win 14 games in a row,” the Seattle skipper said after a 6-2 victory over the Texas Rangers on Sunday.\n\nSure is.\n\nRodríguez hit a two-run double and France homered after joining the rookie sensation on the AL team as the Mariners moved closer to the team record of 15 consecutive wins. That streak came during their most recent playoff season in 2001, when they went 116-46.\n\nThe 14-game winning streak is the longest going into an All-Star break in major league history.\n\n“That’s a tough one,” France said. “I think it’ll be good for us to kind of let our bodies recover. There’s a lot of guys in that locker room, they play every day, they’re playing hurt, they’re playing banged up. These next couple of days will be good for them and hopefully we can just keep that rolling.”\n\nCal Raleigh's two-run homer put the Mariners ahead for good in the fourth inning as they matched reigning World Series champion Atlanta's June streak for the longest this season. St. Louis had a 17-game winning string last year.\n\nRodríguez, who wasn't even six months old the last time the Mariners were on a streak this long 21 years ago, lined a double off the wall in left-center field in the seventh, then raced home on France's single for a 6-1 lead.\n\nThe 21-year-old from the Dominican Republic was barely hitting .200 and didn't have any of his 16 homers on May 1. Now Rodríguez is the first rookie All-Star for the Mariners since Ichiro Suzuki in — yeah, you guessed it — 2001.\n\n“This is a stretch we’re in, I don’t think anybody will ever forget it,” Servais said. “But what a way to end the first half.”\n\nRaleigh pulled a two-out, two-run homer down the line in right field for his 13th homer, erasing a 1-0 deficit as the Mariners won for the 22nd time in 25 games and swept a fourth consecutive series for the first time since 2001.\n\nFrance's solo shot in the fifth, his 11th homer, came a couple of hours after the first baseman was added to the American League All-Star team. Los Angeles Angels outfielder Mike Trout was sidelined by back spasms for Tuesday's game at Dodger Stadium.\n\n“It had kind of gotten to the point where that kind of hope was out the window,” said France, whose two hits boosted his average to .308. “I was getting ready for the game, and it all went down.”\n\nServais said the addition of France was overdue as one of the last replacements, but both agreed better late than never. Plus, Rodríguez, who declined to talk to reporters after the game, has company.\n\n“Julio said he needed someone to babysit him,” Servais said. “So Ty will have his work cut out for him.”\n\nMarcus Semien's 12th homer, a solo drive, put Texas ahead in the third before the Rangers were swept in a four-game series for the first time this year while matching their season worst at eight games under .500 (41-49).\n\n“We need a few days off, kind of collect our thoughts,” manager Chris Woodward said. “Let our bodies rest a little bit. The guys are tired. They were fighting to the end.”\n\nWith Seattle leading 2-1 in the fourth, reliever Ryan Borucki (2-0) walked his first two batters to load the bases with two outs before getting rookie leadoff hitter Josh Smith on a groundout. The left-hander retired Semien, All-Star Corey Seager and Nathaniel Lowe in order in the fifth.\n\nTexas starter Glenn Otto (4-6) dropped to 0-4 in five starts since spending 15 days on the COVID-19 list. The right-hander stayed in after getting hit on the right side and arm by the barrel of Eugenio Suárez's broken bat in the second, allowing three runs in six innings.\n\nMariners right-hander Chris Flexen gave up a run in 3 2/3 innings after starting on three days' rest for the first time in his career. Paul Sewald, the last of six Seattle pitchers, worked a scoreless ninth after a leadoff walk.\n\nYO, COME BACK\n\nSeager and Semien lost track of the outs in the third inning, when Semien started what the high-paid pair thought was an inning-ending double play.\n\nAfter the shortstop Seager’s relay beat France at first, he and his second baseman jogged toward the dugout and even had first baseman Nathaniel Lowe partially convinced. Lowe started to join them but was the first to realize there were two outs.\n\nSemien and Seager, who signed for a combined $500 million in the offseason, finally caught on as they were approaching the dugout steps.\n\nUP NEXT\n\nAfter the All-Star break, Seattle has a six-game homestand against the Texas teams. AL West-leading Houston visits first starting Friday. Servais said LHP Marco Gonzales was the likely starter.\n\nThe Rangers play at Miami on Thursday in a makeup game from the delayed start of the season, then go to Oakland. RHP Jon Gray, the opening day starter, is expected to face the Marlins.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 22,
		"title": "Mariners win 13th in row, top Texas 3-2 in 10 innings",
		"date": "07/16/2022 04:50 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ARLINGTON, Texas -- — J.P. Crawford was facing a different situation at the plate for the streaking Seattle Mariners after Sam Haggerty stole third base in the 10th inning.\n\n“Made our jobs a whole lot easier,” Crawford said. “Changed the whole infield. Now a lot of more holes are open, and we have an extra opportunity not to waste an out to try to get him over. Just get him in.”\n\nCrawford got Haggerty in with the tiebreaking run when he chopped a one-out single down the line past first base and the Mariners stretched their winning streak to 13 games with a 3-2 win over the Texas Rangers on Saturday.\n\nCarlos Santana homered as the Mariners (50-42) moved closer to the club-record 15-game winning streak set in their last playoff season in 2001. They have won 21 of their last 24 games overall to take eight series in a row, their most since winning 14 straight sets during that 116-win season 21 years ago.\n\n“Everybody’s just doing their job, pitching in and really keeping a very calm demeanor about them,” manager Scott Servais said. “You’re not always going to get the big hit or get a big shutdown inning. But we’ve been able to do it through the streak, and it has been awesome.”\n\nSeattle would match the longest winning streak in the majors this year with a victory in the series finale Sunday, its final game before the All-Star break. Reigning World Series champion Atlanta won 14 games in a row last month.\n\nCrawford got the hit off Brett Martin (0-5), who was the fifth Texas pitcher and went the last two innings. Haggerty was the automatic runner to start the 10th, coming on as a pinch-runner for Santana, who had an inning-ending groundout in the ninth. Servais said it was Haggerty’s call to steal third.\n\n“He said, ‘Hey Skip, I think I can get to third base on this guy.’ ... He’s paying attention the inning before knowing that he might end up in the game,” Servais said. “Don’t play scared. You’ve got to play to win. And that’s what we’re doing.”\n\nDiego Castillo (7-1) faced only three batters in the ninth, benefitting from a double-play liner after walking the leadoff batter. Matthew Festa struck out the side in the 10th for his first career save.\n\n“We had a chance to win the game, we didn’t. We didn’t make baseball plays today. That’s plain and simple,” Rangers manager Chris Woodward said. “I’m not going to get into specifics, but we didn’t play team baseball at the end of the game to win a game.\"\n\nCrawford and Santana both returned to the Mariners lineup. Crawford had missed two games because of a bruised right index finger, and Santana was reinstated from the restricted list after being away from the club for a day after a fire at his home in Florida — his family wasn't there at the time.\n\n“I was definitely playing today no matter what,” Crawford said. “It felt good to pick up the boys.”\n\nTy France, who had three more hits to raise his batting average to .306, singled in the third before Santana hit his eighth homer of the season to put the Mariners up 2-1. France had a one-out double in the ninth, but his pinch-runner got stranded on base.\n\nNathaniel Lowe led off the Texas second with a double and scored on a single by Jonah Heim. The Rangers tied the game in the seventh after a leadoff double by Leody Taveras before Elier Hernandez singled to get his first career RBI. Taveras has hit .593 (16 of 27) with six doubles in a seven-game hitting streak.\n\nSHORT HOPS\n\nIt was Seattle’s seventh one-run win during its current streak. The Mariners’ 21 one-run wins overall are tied with Toronto for the most in the majors. The Rangers are tied for the major league lead with 20 one-run losses. ... All-Star SS Corey Seager had his first triple with the Rangers, but saw the end of his career-best RBI streak at eight games.\n\nFOR STARTERS\n\nRight-hander Logan Gilbert, trying to become the first Mariners starter since Félix Hernández in 2015 to win 11 games before the All-Star break, struck out four without a walk and allowed one run over five innings. Rangers starter Spencer Howard struck out three and walked five, one intentionally, pitching into the sixth. The only runs he allowed were on Santana’s homer.\n\nTRAINER’S ROOM\n\nRangers: RHP Johnathan Hernandez was activated from the 60-day injured list and pitched a scoreless seventh with one strikeout. He missed all of 2021 recovering from Tommy John surgery. RHP A.J. Alexy was sent to Triple-A Round Rock.\n\nUP NEXT\n\nRHP Chris Flexen (6-8, 3.84 ERA), who is 4-0 with a 2.53 ERA in five career starts against Texas, takes the mound for the Mariners in the final game before the All-Star break. Rangers rookie RHP Glenn Otto (4-5, 5.50) has given up no more than two runs in eight of his 12 starts overall, but has allowed 10 earned runs his last two home starts.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 23,
		"title": "12 Ks for Ray, slam for JRod and 12 Ws in row for Mariners",
		"date": "07/15/2022 08:26 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ARLINGTON, Texas -- — Reigning AL Cy Young Award winner Robbie Ray doesn't recall being part of a run quite like what the Seattle Mariners are on these days. Everything is a new experience in the big leagues for All-Star rookie center fielder Julio Rodríguez, and he just keeps doing impressive things.\n\nRay struck out 12 without a walk over 6 2/3 innings before Rodríguez hit a emphatic grand slam as the Mariners extended their longest winning streak in more than two decades to 12 games with an 8-3 win over the Texas Rangers on Friday night.\n\n“He doesn’t let the moment be bigger than it is and in that situation,” Ray said of the 21-year-old outfielder who played his 89th game in the majors.\n\nRodríguez hit his first slam on a full-count pitch with two outs to straightaway center for his 16th homer, and finished with a career-best five RBI. His run-scoring single in the fourth put the Mariners ahead 3-0.\n\n“Tonight was more of our typical formula, dominant starting pitching,\" manager Scott Servais said. “We got some big hits tonight, no question about it. Talk about Julio, that is as good as at-bat against a quality bullpen arm. ... The looks in our dugout when that ball went over the fence, was like, did he just really do that? But he’s a special player.”\n\nAfter Seattle loaded the bases on a single and two walks by reliever A.J Alexy to start the eighth, José Leclerc struck out back-to-back batters, but was unable to get a third strike past Rodríguez.\n\n“We fought, we got within a run, you could feel the momentum. We were one pitch away from, that whole eighth inning, the bottom of the eighth changes,” Rangers manager Chris Woodward said. “It’s heartbreaking. But like I've said many times this year, we've got to bounce back and come back tomorrow.”\n\nThe only time the Mariners had a longer winning streak was their team-record 15 in row in 2001, their last playoff season. They have won 20 of their last 23 games overall. Atlanta has the only longer streak in the big leagues this season with 14 consecutive wins last month.\n\nEugenio Suárez doubled and scored Seattle’s first run in the fourth. His sacrifice fly an inning later made it 4-0 before Corey Seager and Leody Taveras homered for the Rangers.\n\nRay (8-6) matched his season high for strikeouts while allowing three runs, on those two Texas homers. It was his 15th game since the start of 2021 with at least 10 Ks, tied with Milwaukee's Corbin Burnes for the most in that span. Ray had 10 such games last season when the lefty won the AL Cy Young Award while pitching for Toronto.\n\n“That’s probably the best I felt all year. I felt like everything was working really well for me,” said Ray, who after Seattle's four-run third struck out five Rangers in a row. “When your team puts up a crooked number, you go out and attack, attack the zone and try to get back in and get some more runs.”\n\nTaylor Hearn (4-6) matched his career high with seven strikeouts over four innings after Matt Bush pitched a scoreless first as an opener. Hearn allowed four runs, two earned, while giving up five hits and walking two.\n\nSeager’s 22nd homer came a day after being added to the American League All-Star team and the Home Run Derby. He will face Rodríguez in the first round of the derby next week at Dodger Stadium, which was Seager’s home his first seven big league seasons before going to Texas in free agency last winter on a $325 million, 10-year contract.\n\nThat two-out solo shot in the sixth was Seager's seventh homer in the past 10 games, and extended his career-best RBI streak to eight games. His career high for homers is 26 in 2016. Taveras hit a two-run homer in the seventh to cut the deficit to 4-3.\n\nONE HOP, NO HOP FOR OUT\n\nMariners DH Justin Upton was thrown out trying to score from second base on the single by Rodríguez in the fourth. Elier Hernández, playing only his second game in the majors after more than a decade in the minors, fielded the ball on one hop in shallow left field and made a direct in-air throw that allowed catcher Jonah Heim to make the grab and tag out Upton in one motion.\n\nTRAINER'S ROOM\n\nMariners: SS J.P. Crawford was out of lineup for the second game in a row since bruising his right index finger during a doubleheader Wednesday at Washington. Servais said the finger only really limits Crawford throwing, and that he could be available to hit.\n\nUP NEXT\n\nMariners right-hander Logan Gilbert (10-3, 2.80 ERA) allowed one earned run over 12 2/3 innings in his previous two starts against the Rangers this year. Texas right-hander Spencer Howard (1-1, 8.04) is 1/3 with a 9.95 ERA in his seven career games (six starts) at Globe Life Field.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	},
	{
		"id": 24,
		"title": "Mariners rally past Rangers 6-5 for 11th consecutive victory",
		"date": "07/14/2022 08:49 PM PDT",
		"author": "AP ",
		"source": "ESPN",
		"body": "ARLINGTON, Texas -- — Ty France hit a two-run single in the eighth inning as the Seattle Mariners rallied from a four-run deficit and beat the Texas Rangers 6-5 on Thursday night, extending their winning streak to 11 games.\n\nSeattle’s win streak is the second-longest in club history behind the 2001 Mariners, who won 15 straight. That team was the franchise’s most recent playoff team. The run is also the second-longest streak in the majors this season, behind Atlanta’s 14-game win streak.\n\n“Eleven wins in a row – incredible,” M’s manager Scott Servais said. “Incredible group we’ve got.”\n\nThe Mariners have gone 19-3 since being 10 games under .500 on June 19 and have moved into the AL wild-card race. The winning streak has featured six one-run games, plus an extra-inning victory.\n\nThe Mariners trailed 5-1 going to the seventh inning before tagging Texas’ bullpen for two runs in the seventh and three in the eighth. Up to that point, Seattle’s only run came on No. 9 hitter Sam Haggerty’s inside-the-park homer in the fourth inning.\n\nMatt Festa (2-0) pitched a perfect seventh inning and earned the win. Diego Castillo stranded runners at first and second in the ninth inning and picked up his sixth save in six chances.\n\nHaggerty had his fourth career four-hit game and his second in 10 days.\n\n“You just feel like you can win every game at some point, and we’re kind of on one of those stretches,” Haggerty said. “I don’t believe anybody in the dugout felt for a moment that we didn’t have a chance to come back.”\n\nCorey Seager, added to the American League All-Star team and the Home Run Derby earlier Thursday, had a double and two RBI for Texas, which is 4-3 during a 10-game homestand, its longest of the season.\n\n“A gut punch,” Rangers manager Chris Woodward said. “We’ve had a few of them.”\n\nTexas starter Martin Perez allowed one run on three hits, and matched a career high with nine strikeouts before being pulled after five innings and 102 pitches. Perez sought his eighth straight win.\n\nHaggerty and Julio Rodriguez scored on Eugenio Suarez’s single in the seventh inning, pulling Seattle within 5-3. After pinch-hitter Adam Frazier, Abraham Toro and Haggerty loaded the bases in the eighth with none out, reliever Dennis Santana (3-5) hit Rodriguez to pull Seattle within a run. France followed with his single to left, scoring Toro and Haggerty.\n\nSeattle starter Marco Gonzales gave up all five runs on a season-high 11 hits, one short of his career high. But reaching the sixth inning helped a bullpen coming off a Wednesday doubleheader at Washington in which relievers threw 12 total innings.\n\n“We know who we are; we know how good we are,” Gonzales said.\n\nANOTHER INSIDE JOB\n\nHaggerty’s homer in the fourth inning was a liner to shallow center that skipped past Leody Taveras and bounced to the wall. It was the second inside-the-park homer at Globe Life Field in four games. On Monday, Rangers rookie 3B Josh Smith had one under near identical circumstances involving Oakland CF Ramon Laureano.\n\n“I hit third base, and it just felt like I hit quicksand,” Haggerty said.\n\nWELCOME TO THE SHOW\n\nElier Hernandez made his big-league debut as Texas’ DH after having his contract selected from Triple-A Round Rock. The 27-year-old singled in his first at-bat, scored, and singled again in the sixth.\n\nSHORT HOPS\n\nTexas RF Adolis Garcia singled in the first to end an 0-for-18 skid. … Heim had two doubles and Taveras two singles for Texas. … The Rangers optioned OF Steven Duggar to Round Rock to make room for Hernandez on the roster. … Servais said RHP Chris Flexen will start Sunday’s series finale on short rest on the final day before the All-Star break.\n\nTRAINER’S ROOM\n\nMariners SS J.P. Crawford was scratched from the original lineup with a finger injury and is day to day.\n\nUP NEXT\n\nFriday night’s game will match Mariners LHP Robbie Ray (7-6, 3.51 ERA) against Rangers RHP Taylor Hearn (4-5, 5.86). Ray has allowed only four earned runs in 39 2/3 innings in his last six starts. Hearn, added to the taxi squad on Thursday, most recently pitched for the Rangers on June 25 and started twice for Round Rock since then.\n\n------\n\nAstros starter Lance McCullers Jr., will make his season debut Saturday against the A's after being sidelined all year with a flexor tendon injury.\n\nThe Cubs take an early 3-0 lead on three straight two out hits from Seiya Suzuki, Nico Hoerner and Ian Happ.\n\nThe Orioles tie the Red Sox 3-3 on Terrin Vavra's two-run triple and Austin Hays' RBI single in back-to-back at-bats.\n\nFrom Jason Varitek to Cody Bellinger, check out former and current MLB players during their time in the Little League World Series.\n\nPaul Goldschmidt hits a home run in the seventh inning, and Nolan Arenado follows with a long ball of his own.\n\nEmmanuel Rivera and Daulton Varsho hit doubles to score five runs for the Diamondbacks in the seventh inning.\n\n"
	}
]